[
  {
    "text": "Maybe a mistake in L1.10 image1366×768 85.9 KB\nIn return block, maybe there is a bug because here we have to use self._elasped_time instead of self_elasped_time. Can anyone clarify it?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/maybe-a-mistake-in-l1-10/178818"
  },
  {
    "text": "Regarding CGPA calculation In the student handbook I came across this table of total points for project (to get 7 cgpa in project). But I think the total points column values are incorrect. As we know-\nS=10   A=9    B=8   C=7  D=6  E=5\nso E+E+S+S=5+5+10+10=30 right? but in table(1st row) it is given as 28. The same thing happens for other rows as well. can @POD_TEAM or anyone clarify please?\nimage512×171 16.5 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-cgpa-calculation/178934"
  },
  {
    "text": "Week 2,AQ 2.3 ,Q1 How many swaps does Selection Sort make to sort the array [64, 25, 22, 12, 11, 3] ? Note: Swaps are counted even if the element is swapped with itself\nFirst swap gives [3,25,22,12,11,64]\nSecond swap [3,11,22,12,25,64]\nThird swap [3,11,12,22,25,64]\nFourth swap for 22 , [3,11,12,22,25,64]\nFifth swap for 25 , [3,11,12,22,25,64]\nSixth swap for 64, [3,11,12,22,25,64]",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-aq-2-3-q1/178844"
  },
  {
    "text": "Learnsy – Convert Any YouTube Playlist into a Streak-Driven Study Routine No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/learnsy-convert-any-youtube-playlist-into-a-streak-driven-study-routine/178039"
  },
  {
    "text": "Question in lecture 2.2 Independence of multiple variables Screenshot 2025-06-02 1610221142×866 213 KB\nMy specific doubt is on the topic: Independent and identical distribution.\nMy doubt is: How the value of P(A’ Intersection C’) in (14/16)^n.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/question-in-lecture-2-2-independence-of-multiple-variables/177330"
  },
  {
    "text": "Selected for PhD at IIT Bombay CSE Department A small dream, a long journey, and a big blessing!\nFrom not clearing JEE Advanced to now joining IIT Bombay - Computer Science Dept. for PhD.\nGrateful and excited for this new chapter!\nDo check out my story on LinkedIn \n\n\nlinkedin.com\n\n\n\n#phd #iitbombay #computerscience #nevergiveup #hardwork #godsplan | Tarang...\nFrom not qualifying JEE Advanced to getting a PhD admission offer from IIT Bombay — Computer Science Department. 🙏💻📚\n\nLife truly comes full circle.\n\nYears ago, I couldn't crack JEE Advanced. It was heartbreaking—but I didn’t let that define me. I...",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/selected-for-phd-at-iit-bombay-cse-department/178896"
  },
  {
    "text": "What is happening here? What is Discourse? got a link in mail, now im here, can anyone tell me what’s going on?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/what-is-happening-here-what-is-discourse/177365"
  },
  {
    "text": "Internship related : Scam ya real? Kindly ensure that all course-related queries are posted in their respective course categories.\nsomeone plzz tell me what is that internship program i have payed 6000 rupees is it a scam??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/internship-related-scam-ya-real/178835"
  },
  {
    "text": "Job opportunity: Quant modeler @ Barclays You will be responsible for developing best in class credit risk models using industry leading model development frameworks & methodologies, work in a global quant team, with regulators across the world and cutting-edge technology.\nYou may be assessed on the key critical skills relevant for success in role, such as experience with end-to-end model development, experience on coding languages like Python OR R OR C++, as well as job-specific skillsets.\nTo be successful as a Quant Analytics Wholesale Credit Risk Modeller you should have experience with:\n\nHands on coding experience (as a full-stack developer / agile developer etc.)\nPreferable language is Python, C/C++.\nYou must have knowledge of the following in Credit Risk (Pillar 1 - Probability of Default (PD), Loss Given Default (LGD), Exposure of Default (EAD),\nExperience in IFRS9/CECL/ CCAR can also be considered\nYou must have stress Testing/Scenarios Modelling), Model Development and/or Model Validation (core development experience), Statistical Modelling (preferably for Wholesale credit book).\nRole is based in Mumbai (hybrid)",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/job-opportunity-quant-modeler-barclays/178918"
  },
  {
    "text": "I purchased internship from practsphere ( got a mail on official college id) . But i only paid partial amount ( registration fees 1000) they are asking for another 5K for full internship . I have read that it is a scam on this discussion forum what should I purchased internship from practsphere ( got a mail on official college id) . But i only paid partial amount ( registration fees 1000) they are asking for another 5K for full internship . I have read that it is a scam on this discussion forum what should i do next ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/i-purchased-internship-from-practsphere-got-a-mail-on-official-college-id-but-i-only-paid-partial-amount-registration-fees-1000-they-are-asking-for-another-5k-for-full-internship-i-have-read-that-it-is-a-scam-on-this-discussion-forum-what-should/178839"
  },
  {
    "text": "Time of lab I am s.naraender 24f2100326 booked for programming and estc lab course which would fall on 13 and 14 of this month June but I didn’t receive the timing yet please guide me as soon as possible",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/time-of-lab/178907/1"
  },
  {
    "text": "Refund policy of course drop (topic deleted by author)",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/refund-policy-of-course-drop/178897/1"
  },
  {
    "text": "My Interview Experience for MTech/MS/PhD Hey all!  I’ve shared my interview experiences for IISc, IIT Bombay, IIT Delhi & IIT Gandhinagar (M.Tech/MS/PhD in DS & ML) on LinkedIn. Hope it helps future aspirants!\nCheck it out here \n\n\nlinkedin.com\n\n\n\nInterview Experience for MTech/MS/PhD | Tarang Pansuriya\n🎯 Interview Experiences – IISc, IIT Bombay, IIT Delhi & IIT Gandhinagar (M.Tech / PhD / MS)\n\nOver the past few months, I appeared for interviews at some of the top institutes in India for Data Science, Machine Learning and AI related programs —...",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/my-interview-experience-for-mtech-ms-phd/178895/1"
  },
  {
    "text": "So less activity on discourse these days Because of Paradox, not much people are active of discourse",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/so-less-activity-on-discourse-these-days/177934"
  },
  {
    "text": "GA4 - Data Sourcing - Discussion Thread [TDS May 2025] Please post any questions related to Graded Assignment 4 - Data Sourcing.\nDeadline: \nSunday, June 22, 2025 11:59 PM\n@carlton @Jivraj @HritikRoshan_HRM",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga4-data-sourcing-discussion-thread-tds-may-2025/178881/1"
  },
  {
    "text": "Week 3 tutorial 4 Given Problem: To find Dependent and Independent vectors of R3. Given vectors are {(1,1,-3), (-1,1,-1), (-1,-1,3)}\nFor this problem, In the week3 tutorial4, how does the lecturer arrive at x+2y+z as the equation that satisfies for all the 3 vectors? Also what is the need when already we concluded they are linearly dependant since det(A)=0?\nCan someone enlighten please? Thanks",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-tutorial-4/178867/1"
  },
  {
    "text": "Mistake in Grpa I have checked the output in python live tutor and in chatgpt also the output is same as the questions want but in grpa it is showing wrong here is the code\nlst = eval(input()) # this will load the list from input\nfor i in lst:\n    print(i,\" - \", \"type: \",type(i))\n\nThe input is [1,2.0,“type”,True]\nScreenshot 2025-06-11 2135181349×324 24.6 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mistake-in-grpa/178879/1"
  },
  {
    "text": "Activity question 3.5 Q9 IMG_09451441×990 147 KB\nHow are options 1 and 3 correct?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/activity-question-3-5-q9/178862/1"
  },
  {
    "text": "Live classes Mandatory or Optional? Is it mandatory to attend live session? if i dont hve any doubts\nalso are they teaching extra thing than the one in the videos or is it just revision nd summarys which can likely be skipped",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/live-classes-mandatory-or-optional/178857/1"
  },
  {
    "text": "My SCT Approved and Week 2 GrPa 3 obtain 0 marks @Manidipa2001 @piyushw @23f2004399 Please confirm me, my SCT Approved\nScreenshot 2025-06-11 172315412×668 27.5 KB\nIn Week 2 GrPa 3 Evaluation pending and I received 0 marks\n@Manidipa2001\n@piyushw\n@23f2004399\nScreenshot 2025-06-11 1727271464×790 95.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/my-sct-approved-and-week-2-grpa-3-obtain-0-marks-manidipa2001-piyushw-23f2004399/178851/1"
  },
  {
    "text": "Link to register for one-to-one mentorship for May 2025 term Please share the link to register for online bootcamp and one-to-one mentorship for MAD 1 project also share the G-space link",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/link-to-register-for-one-to-one-mentorship-for-may-2025-term/178713/1"
  },
  {
    "text": "Intership I have got this offer of internship, so is it fake or a legit intership offer?\nimage_2025-06-08_1323438091664×997 94.1 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/intership/178195/1"
  },
  {
    "text": "Confusion about how to use the course portal efficiently I don’t yet understand how to use the course portal efficiently. For example, whenever I complete a course video, the circle on the left side still remains grey. However, when I complete an assignment, the circle turns blue. Is it supposed to be like this?\nAlso, I have to log in every time I want to access the course. Is this necessary, or is there a way to stay logged in?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/confusion-about-how-to-use-the-course-portal-efficiently/178634/1"
  },
  {
    "text": "SCT is approved or not? How to know whether the SCT is approved or not?.\nBecause it’s been a long time since I gave it.\nNeed to know that as I live in a hostel and need to go back home.\nAlso can I give SCT from my home with same kind of Setup that I’ll be having in my hostel??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-is-approved-or-not/178505/1"
  },
  {
    "text": "Regarding Offline Bootcamp for MAD 1 I have got the email to register for offline bootcamp for mad 1 and after logging in I can also see the that bootamp but when I click Confirm and Pay, its give me ERROR 500 (without giving the fees)\nPlease confirm whether I am eligible or not as I have booked my train tickets now.\nI have registered in this term only for both Theory MAD 1 Course and Project too.\n@shivani28\n@shri_krishna_pandey\n@satyanarayana\n@AdarshMadre",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-offline-bootcamp-for-mad-1/178704/1"
  },
  {
    "text": "Regarding usage of AI tools This MAD 1 projects is my first experience with application development. I learnt Programming language for first time in this BS program. I am finding the project difficult. How much help can i take from ChatGPT  to complete the project like while facing error etc etc .  I am not saying just copy paste the project from ChatGPT  and submitting to portal .I am saying when i get stuck , unable to resolve the error,don’t know how to style a particular thing ,don’t know how to proceed with code ,don’t know what library to import will give me the desire output like in such situation . is copying small pieces of code from documentation , projects available on internet ,ChatGPT which is giving me the desired output can result into plagiarism ?    Kindly Guide",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-usage-of-ai-tools/178821/1"
  },
  {
    "text": "Query About Form Release for MAD1 Online Bootcamp (July 1st-14th) I am writing to inquire about the form for the upcoming MAD1 Online Bootcamp, which is scheduled to take place from July 1st to 14th. Could someone please let me know when the registration or application form will be released?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-about-form-release-for-mad1-online-bootcamp-july-1st-14th/178820/1"
  },
  {
    "text": "WEEK0 Practice assignment 0.2.2 Q8 image1389×115 14.4 KB\nplease help and correct me where i am wrong, firstly the prob of coming heads is 0.5 and red marble coming from urn a prob is 3/5 so 0.5*3/5 should be the answer!!! why we wanna add the probability of red marble from urn B its cancels out after we getting heads on the first place!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week0-practice-assignment-0-2-2-q8/178809/1"
  },
  {
    "text": "SCT Results My SCT Python result has yet not been published and is not visible on my dashboard like neither it is showing 1 nor 0 can anyone please tell guide me regarding this\n@livin\n@kubra_7\n10000493791080×2400 279 KB\n10000493761080×2400 206 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-results/178789/1"
  },
  {
    "text": "Important Announcement: Opportunity to Meet Week-2 PDSA OPPE Eligibility No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/important-announcement-opportunity-to-meet-week-2-pdsa-oppe-eligibility/176710/1"
  },
  {
    "text": "Bs student eligible for inter iit sports meet? Are BS students eligible for the Inter-IIT Sports Meet? According to the rulebook, students who are going to receive a degree are eligible.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/bs-student-eligible-for-inter-iit-sports-meet/178734/1"
  },
  {
    "text": "Missing code from Week 3 Graded Assigment My specific doubt is on the topic: Q5 and Q10 doesn’t have code\nMy doubt is: Code is not given in Q5 and Q10 of the Week 3 graded assignment, and the output for a given input has been asked. Is this a glitch, or have I missed something?\n@23f2004399 , @salim0986\nimage1032×501 26.1 KB\nimage511×359 12.8 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/missing-code-from-week-3-graded-assigment/178220/1"
  },
  {
    "text": "SCT Related Doubts | T1- 2025 | Post Here I have already got SCT Approval for the OPPE exam for the previous term. i have registered OPPE for this term as well. but i have received an email \"willingness to attend SCT again. I need your guidance that this is mandatory to get SCT approval again or the previous approval is enough? Kindly revert me with an update.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-related-doubts-t1-2025-post-here/164573/1"
  },
  {
    "text": "MAD 2 Project Gspace No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-2-project-gspace/177950/1"
  },
  {
    "text": "SCT result may 2025 term Is anyone else unable to see their SCT result for the Python Foundation course? It’s been a week since the test ended, but I still can’t find the result on my dashboard. Does anyone know where or when it will be available?\nThanks in advance.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-result-may-2025-term/178008/1"
  },
  {
    "text": "Improper file in the University dataset from ‘Dataset’ resource of DBMS 2025 The .tar file in University dataset is 0 KBs\nWhen downloaded, the .tar file is 0 KBs\nimage1176×264 12.7 KB\nBut it appears to be 215 KB before downloading.\n\nCould @PiyushW or @Nalini kindly look into it?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/improper-file-in-the-university-dataset-from-dataset-resource-of-dbms-2025/178712/1"
  },
  {
    "text": "Query regarding one-to-one mentorship Good morning respected instructors,\nAs per the project document for App Dev - 1, the form for the one-to-one mentorship has been opened. From where can we access the said form?\nKindly confirm.\nBest regards.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-one-to-one-mentorship/178771/1"
  },
  {
    "text": "Invite Expired on GitHub image980×615 35.7 KB\nI checked my project repository today, and found the invite to be expired. So I have deleted the invite and resent it.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/invite-expired-on-github/178764/1"
  },
  {
    "text": "Can not use IITM email address for google cloud and Gemini key creation for GenAI projects I have a query regarding accessing the google cloud services as well as Gemini Free Key creation with IITM email address (for Generative AI course).\nFor E-Learn NPTEL  Generative AI course, I need to make sure to install or have proper access to all required software’s like n8n, google cloud and Gemini Key beforehand. But unfortunately, while creating projects in google cloud or creating API Key for Gemini, I am getting errors like  :\nFailed to generate API key: permission denied. Please try again.\nAlso similar issue in creating the google cloud project using IITM Email address .\nI have attached a screenshot for the same.This similar issue may come while doing handson or assignments for a given workshop or for my BS degree projects.\nCan you please look into this matter with urgency and let me know if there is any other solution for the same.\nimage2552×1305 191 KB\nimage2545×1072 156 KB\nBr,\nAshvin Ambatwar",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/can-not-use-iitm-email-address-for-google-cloud-and-gemini-key-creation-for-genai-projects/178762/1"
  },
  {
    "text": "Regd OPPE and SCT approval My specific doubt is on the topic: I submitted the photo and the gform within the stipulated time but my OPPE and SCT are not approved.  please help\nMy doubt is: I am sharing my photo. please check. Will there be any other date given for re-submission. @PiyushW\nSCT-23F10016961822×938 61.8 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regd-oppe-and-sct-approval/178752"
  },
  {
    "text": "Urgent: Not able to access the course I am not able to acess the course content despite registering in this term. I have mailed to the support team multiple times but yet the issue remain as it is. The exam centre details is updated in the dashboard but the course content is not showing under current courses. Please solve this issue as soon as possible.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/urgent-not-able-to-access-the-course/177967"
  },
  {
    "text": "For students in foundation course 2025-26 Hello everyone,\nWe have created this group in google chat for the students who are enrolled in may 2025 batch.\n\n\naccounts.google.com\n\n\nSign in - Google Accounts",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/for-students-in-foundation-course-2025-26/178743"
  },
  {
    "text": "They Have No Words—Only Eyes That Plead for Help  Be Their Hope On the vast campus of IIT Madras, hidden between lecture halls and hostels, live countless cats  who ask for nothing—just a little kindness.\nWhen they’re hungry, sick, injured, or abandoned, they don’t cry out. But a group of students hears them anyway. Friends of Animals, a student-run volunteer group, has become their only family —feeding them , treating their wounds , taking them to the vet after accidents , and ensuring they aren’t lost to disease or suffering.\nThese students don’t do it for credit or recognition. They do it because every life, no matter how small, deserves love . Your support can be the difference between suffering in silence or healing in care.\nI am part of the Friends of Animals group at IIT Madras, which is a group of in-person campus students that share a common goal for taking care of cats. Apart from the members of the group that fund care for cats ( Cats in a critical condition due to infections, wounds due to territorial fights, accidents due to careless driving, neutering, spaying, and other care), we are not able to help all cats in the campus as we severely fall short of funds and hence we depend on people’s generous funding as the sole source of money after a point.\nIn case you are willing to donate any amount of money towards this noble cause, please feel free to do so. As an animal lover, it feels extremely sad to be unable to reach out to the animals who plead for help just because we fall short of funds. Your help would stave off the unnecessary and needless suffering of these innocent animals. Please help us continue giving these voiceless souls the safety, love and compassion they deserve .\nhttps://milaap.org/fundraisers/support-cats-31/deeplink?deeplink_type=paytm",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/they-have-no-words-only-eyes-that-plead-for-help-be-their-hope/178534"
  },
  {
    "text": "Can admin increase no of parking spots? Hello sir/madam,\nI saw under the roles section, it mention that admin can increase no of parking spots inside the lot, but under core functionalities, its admin cannot add a parking spot. The wireframe also doesn’t show that admin can increase no of parking spots. I am a bit confused, should i make admin be able to increase parking spots or not.\nAlso when admin decreases the no of parking spots, should the maximum no of parking spots remain the same or change.\nI also noticed that last term there was a google chat for this project, but this i term i didnt find one for both mad 1 and mad 2 projects i am doing. Is there no google chat for projects this term? If there is can you please invite me for both the mad 1 and mad 2 projects.\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/can-admin-increase-no-of-parking-spots/175398"
  },
  {
    "text": "Technical support regarding link: live classes I can’t find the link for live classes , pls guide me",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/technical-support-regarding-link-live-classes/178711"
  },
  {
    "text": "Placement activity points (Make sure that you have applied a tag while posting. Use the below template while posting your queries in the forum. Both these actions from your end will help the course instructors and peers to address your query more effectively. You can remove this portion while posting your query)\nMy specific doubt is on the topic: \nMy doubt is: \nDo we have to register using IIT is on leadcode website\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/placement-activity-points/176832"
  },
  {
    "text": "Quiz 1 details on dashboard Screenshot (78)1920×1080 277 KB\nI am a JEE based entry in the may 2025 term . Issue regarding quiz1 details are not showing in the  dashboard and whether the QUIZ and END term exam has negative marking . In addition to that what is the total marks and duration of QUIZ AND END TERM EXAM.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/quiz-1-details-on-dashboard/178242"
  },
  {
    "text": "Paper on Large Reasoning Models from Apple Large Reasoning Models break down on puzzles like the Tower of Hanoi as the complexity increases. Interesting paper from Apple:\n\n\nml-site.cdn-apple.com\n\n\n\nthe-illusion-of-thinking.pdf\n13.24 MB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/paper-on-large-reasoning-models-from-apple/178694"
  },
  {
    "text": "Adding into the gspace of wayanad house Hey everyone ,\nCan any member of the wayanad house please tell the house secretary to add me into the gspace as I have been allocated the wayanad house on 5th June . I have been mailing the secretary and student affairs from past 5 days . I am fed up of writing to them .\nThank you\nScreenshot 2025-06-10 142915782×356 6.69 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/adding-into-the-gspace-of-wayanad-house/178650"
  },
  {
    "text": "Guide for tds project 1 Where can I get a reference or some material that may Guide me to complete the project.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/guide-for-tds-project-1/178649"
  },
  {
    "text": "Doubts of email regarding internship I wanted to ask that i hve recieved an email from launched global in collaboration with iit madras  regarding that i m shortlisted for this internship. but i had just started my foundational year and hve completed only week 1 course till now. So, i wanted to ask that whether I should fill the application form. As i feel  i just started the course , so i m not suitbale  for this internship as i had jusr started with basics though i m eligible for it as mentioned in the mail.\nPls suggest that whether i should try for this internship or not?\nI want to know the expert guidance.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubts-of-email-regarding-internship/178186"
  },
  {
    "text": "Querry about the Admission Letter So I have enrolled in this , But i don’t receive any type of Admission letter why so ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/querry-about-the-admission-letter/177876"
  },
  {
    "text": "Mad 1 project , invitation link has not been accpeted , still showing pending request Mad 1 project , invitation link has not been accpeted , still showing pending request",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-1-project-invitation-link-has-not-been-accpeted-still-showing-pending-request/176514"
  },
  {
    "text": "Week 3 Graded Assignment Questions clarification @livin @kubra_7\nMy specific doubt is on the topic: In the question input is stored in variable called sentence, but words variable is getting split, this will definitely give error similary below question also will give error. refer the screen shot.\nimage723×552 15.1 KB\nHow are you getting “words” from sentence??\nMy doubt is: How are you getting “words” from sentence??\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-graded-assignment-questions-clarification/178518"
  },
  {
    "text": "How to find API key for discourse page I want to access the API key of dicourse page for tds project 1. kindly suggest some ways to access it.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/how-to-find-api-key-for-discourse-page/178166"
  },
  {
    "text": "Clarification on independent binomial trail formulae hey, i just want a clarification on when should one use\n((1-p)^k-1)*p\nand when should\n1-(1-p)^k\ni get is like when you want know a success or a failure of problem at a particular “k” you use the first formula but i wanna know wrt example and situation when to use them",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/clarification-on-independent-binomial-trail-formulae/178275"
  },
  {
    "text": "Live classes joining how? Can anyone tell me how to join the live classes? Where will the link show?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/live-classes-joining-how/178639"
  },
  {
    "text": "Unable to View SCT Result for Python Foundation Course I am unable to see my SCT result for the Python course (Foundation level) on my dashboard. It has been over a week since the SCT test concluded, and I would like to know where I can access my result.\nCould you please assist me with this issue or let me know when and where the results will be published?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unable-to-view-sct-result-for-python-foundation-course/178610"
  },
  {
    "text": "TA live sessions ? what are they? I want to know what are TA sessions and where can I access them for all my courses in term 1 foundational",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ta-live-sessions-what-are-they/178636"
  },
  {
    "text": "Statistics 2 Instructor sessions No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/statistics-2-instructor-sessions/178535"
  },
  {
    "text": "Week 4 stats 2,maths 2 content release date CAN ANYONE TELL ME WHEN THE CONTENT FOR FOR WEEK 4 STATS 2,@ MATHS WILL BE RELEASED, I HAVE NOT GOT THOSE YET.\nMy specific doubt is on the topic: <week 4 stats 2,maths 2 content release date>\nMy doubt is: \n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-4-stats-2-maths-2-content-release-date/178631"
  },
  {
    "text": "A possible glitch in the course portal and with the GrPA I am trying to submit the GrPA assignments of week-3, but when i click on the test run button nothing is happening and it just goes in circles. An error pops up saying something went wrong.\nAlso, once in a while the course page says I am not subscribed to the course and takes me back to the dashboard. Then I will have to click on the course portal again.\nBut the submission of the Assignments is not happening. I have tried multiple internet connections, it is the same.\nMay I know is there any glitch happening or if any things are to be corrected on my end.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/a-possible-glitch-in-the-course-portal-and-with-the-grpa/177835"
  },
  {
    "text": "Week 4 Content Not Visible I am not able to see Week 4. Is it just me, or has the Week 4 content not been uploaded yet?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-4-content-not-visible/178442"
  },
  {
    "text": "Week 3 Graded Assignment Question 10 clarification No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-graded-assignment-question-10-clarification/178499"
  },
  {
    "text": "Jokes has its place! Invite your contributions as well - Part IV Let’s continue onto this part IV from here…\n#JokesOverflow",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/jokes-has-its-place-invite-your-contributions-as-well-part-iv/157575"
  },
  {
    "text": "Using a foreign key as attribute to some class class ABC(db.Model):\nI want to use this class as table.\nmy doubs:\n\nIf want to use these three foreign keys in routes, then how to assign this attribute to some variable??\nIf want to use in time and out time as current time then what should I use in Routes and how to read in HTML??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/using-a-foreign-key-as-attribute-to-some-class/178593"
  },
  {
    "text": "Query about if the quiz 1 mandatory for JEE admission students The IIT Madras has created a WhatsApp group with only the people who have enrolled with the course through jee admission. Eventually a confusion between the students have grown. Is quiz 1 mandatory for the students who has get an admission through jee qualification? Some of us saying that quiz 1 is not mandatory for us. It is optional but the quiz to is mandatory. Some are saying both of quiz 1 and 2 are mandatory. Which one is the correct thing?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-about-if-the-quiz-1-mandatory-for-jee-admission-students/178155"
  },
  {
    "text": "Graded Assignment 2, Q11,Q12,Q13 Can anyone provide the solution to graded assignment 2 Q11,12,13? The comprehension type question at the last?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-2-q11-q12-q13/176769"
  },
  {
    "text": "General Instructions : MAD II MAY25 Welcome Learners \nLead Instructors\n\nAdarsh Madre @AdarshMadre\nAditya Baxla @aditya.baxla\nAbhishek @AbhishekPOD\n\nTag these instructors if there is no response to your post within the first 12 hours\n#TA\nTag TA if there is no response to your post within the first 6 hours\n\nto be updated\n\nTags Usage\n\nPractice Question - week-num-Jan25-term1practice\nGraded Question - week-num-Jan25-term1graded\nOperational - operational-Jan25-term1\nExam - quiz-Jan25-term1\n\nCalendar\n\nCourse Calendar\n\nImportant Links\n\nYoutube playlist\nCourse portal",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/general-instructions-mad-ii-may25/161421"
  },
  {
    "text": "Isn’t it Fake? How are they getting email ids ?\nimage1342×583 48.8 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/isnt-it-fake/178552"
  },
  {
    "text": "I bought all 4 courses for foundation level..is there any way to drop 2 of them? i bought all 4 courses..didnt know that we can also take them later on..so is there any way to drop 2 of them??and continuing with the other 2??i see no option on the website for such change..im also not aware of any deadline to drop a course–if anyone has done it or knows..pls help",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/i-bought-all-4-courses-for-foundation-level-is-there-any-way-to-drop-2-of-them/178498"
  },
  {
    "text": "Activity Question_3.3 image452×875 52.4 KB\nPlease explain this question @PiyushW",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/activity-question-3-3/178492"
  },
  {
    "text": "Doubt in AQ2.1 Which of the following options is/are correct?\na)“Markup” is a way of using cues and codes in regular flow of text that indicates how the text should be displayed.\nb)“Markup” is always computer readable.\nc)“Markup” is not necessarily computer readable.\nd)“HTML” is a markup language.\nCorrect answer given is- a, c, d but it should be a, b, d. Need clarification",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-aq2-1/178189"
  },
  {
    "text": "When and how can I take more courses when and how can I take more courses ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/when-and-how-can-i-take-more-courses/178539"
  },
  {
    "text": "Query regarding user history retention Respected @shri_krishna_pandey sir and @22f3000877 ma’am,\nI have a query regarding the retention of the user history. When the admin deletes a lot or reduces the number of spots (deletes some spots), do we have to retain the parking records of the users who parked in that lot/spot or should we delete those as well or is it fine either way?\nKindly Confirm.\nThanks and regards.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-user-history-retention/178173"
  },
  {
    "text": "Where can i submit handwritten graded assignment Kindly ensure that all course-related queries are posted in their respective course categories. plz help me",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/where-can-i-submit-handwritten-graded-assignment/178516"
  },
  {
    "text": "Understanding the Dropout and Placement Gaps in the IIT Madras Online BS Program: Are Flexibility and Accessibility Enough , I was going through some official documents and placement reports about the IIT Madras Online BS in Data Science & Applications. It’s great that they’re making quality education accessible to everyone, but a few things really stood out to me:\n\nA lot of students aren’t making it all the way to the BS level. Many drop out after the Foundation or Diploma stages.\nThe placement rate is also lower compared to the regular IIT BTech programs. For online BS students, it’s around 60% with an avg package of ₹10 LPA, whereas BTech students get over 80% placements with an avg of ₹22 LPA.\nMany students feel like just getting into this online degree gives them the IIT tag, which carries a lot of value in the industry. But what they don’t realize is—while getting in might be easy, sustaining and graduating is tough. It’s still IIT, not some regular college. You’ve got to put in serious work to earn that degree.\nSource: Program Report - April 2025\nCareer Choices report - April 2025\n\nIt really got me thinking—\n\n\n\nWhat are the primary reasons students fail to continue till the BS level despite the flexible, modular format?\n\n\nHow do academic rigor, self-discipline, and lack of peer engagement contribute to dropouts?\nWhy is the placement percentage lower compared to traditional IIT programs?\nDoes the online degree carry equal recognition in the job market, and how does that affect outcomes?\nWhat can be done to improve both student retention and placement success?\n\nSo for those who’ve been through it or are ahead in the journey, what’s the best advice you’d give to a Foundation-level student who’s just starting out? What should they focus on to stay consistent and reach the BS level successfully?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/understanding-the-dropout-and-placement-gaps-in-the-iit-madras-online-bs-program-are-flexibility-and-accessibility-enough/177706"
  },
  {
    "text": "Clarification Needed! Hi @shri_krishna_pandey & @22f3000877 ,\nI have a question regarding the address and pin code fields in the vehicle parking application for the mad1 project. Right now, the wireframe shows these fields in the registration form, but I was wondering about their actual purpose:\n\n\nAre we asking for the user’s permanent address (which doesn’t change often)? If so, it might be better UX to collect this information in the profile section, rather than during registration.\nOr are we asking for the current location, which changes depending on where the user is booking a parking spot? In that case, it would make more sense to ask for it during the spot booking process.\n\n\nThe reason I’m asking is because the way the registration form currently asks for the user’s address and pin code, it feels like it’s asking for their permanent address. But as far as I know, in most real-world utility apps (like travel, parking, or delivery apps), they typically ask for the current location at the time of booking not during registration.\nSince I’ve completed the rest of my project, this is the only part holding me back from zipping. I’d really appreciate your clarification so I can wrap it up accordingly.\nThanks!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/clarification-needed/178399"
  },
  {
    "text": "Welcome to the App Dev II Project – MAY 2025 Term! Dear Students,\nWe’re excited to kick off the App Development II Project Course for the May 2025 term! This post will help you get started with everything you need to know and access.\nPlease read through carefully and bookmark the links provided below.\n1. Project Document\nComplete details about the structure, core requirements, and deliverables for the project.\nDocument Link\n2. Valid Project Statements (MAY 2025 Term)\nThese are the ONLY valid problem statements for this term. All submissions must align with this scope.\nProject Statement Link\n3. Milestones Document\nTrack your progress through clearly defined checkpoints and deadlines.\nMilestones Document Link\n4. General Information Document\nContains general policies, submission guidelines, FAQs, and support channels.\nGeneral Info Document Link\n5. Live Session Details\nWeekly live sessions to guide your development and clear doubts.\nEvery Monday, 6:00 PM – 8:00 PM (from 16th June)\nGoogle Meet: https://meet.google.com/baf-tfno-ebg\n6. YouTube Playlist\nRecording of the Orientation Session and live sessions of this term will be available here.\nYouTube Playlist Link\n7. GitHub Repo for the code base of project built in the live sessions\nBelow is the GitHub Repo where all the code created, and relevant document used in the project sessions will be pushed.\nGitHub Repo (to be updated)\n8. YouTube Playlist of Previous Term (Jan 2025)\nRecording of the live sessions held in last term are available here.\nYouTube Playlist link\n9. Viva Workflow Portal\nAll viva submissions and evaluations will be managed here.\nViva Portal Link\n10. Git Tracker Document\nThis document includes steps to create a private git repository and add official app dev IDs as collaborators.\nGit Tracker Document\n\nSubmission Timeline\nBatch 1: 10 June – 30 June 2025\nBatch 2: 1 July – 15 July 2025\nBatch 3: 16 July – 30 July 2025\nFinal Submission Deadline: 30 July 2025, 11:59 PM IST (No extensions)\n\nNeed Help? Tag Us!\nFor any queries, please tag your Instructors and TAs:\nInstructors:\nShivani varma: @shivani28\nShri krishna Pandey @shri_krishna_pandey\nSatyanarayana S @satyanarayana\nAdarsh Madre @AdarshMadre\nAditya Baxla @aditya.baxla\nTAs:\nYogendra @ym496\nPradeep Mondal @21f2000709\nHappy learning and developing!\n- App Dev Team",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/welcome-to-the-app-dev-ii-project-may-2025-term/175917"
  },
  {
    "text": "Inclusion into the Wayanad house gchat Hey everyone,\nI actually got allocated the Wayanad house . Can anyone please tell if there is any procedure to join the Wayanad bourse gchat and any other groups in that house as I haven’t been still got admitted into those groups .\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/inclusion-into-the-wayanad-house-gchat/178107"
  },
  {
    "text": "Credit transfer from nptel to bs course I am going to do NPTEL course…Is there any procedure to transfer the credits to my bs degree?(after the exam over)?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/credit-transfer-from-nptel-to-bs-course/178263"
  },
  {
    "text": "Ques 2 Activity 2.4 Maths -2 No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ques-2-activity-2-4-maths-2/165211"
  },
  {
    "text": "Week 2 scores still not updated on dashboard Dear Sir,\nThe submission dates for Week 2 assignment was May 28, 2025. I got the scores on the course portal. But the scores of Week 2 are still not updated on the dashboard. It has been more than 10 days as of now. Kindly look into this matter.\n@livin",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-scores-still-not-updated-on-dashboard/178272"
  },
  {
    "text": "AQ3.5 : doubt in a question regarding Linear Dependence My specific doubt is on the topic: Linear dependence of Vectors\nMy doubt is:\nimage1195×528 41.7 KB\nIn the above Question I dont get as to why options 1 and 3 need to be correct. Can someone explain why this is so?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/aq3-5-doubt-in-a-question-regarding-linear-dependence/178264"
  },
  {
    "text": "Extra Activity 1 – Marks Pending Dear sir/ma’am\nI have not yet received my marks for Statistics 2 Extra Activity 1. Under the Extra Activity 1 section, it states: “As you do not have enough reviews from your peers, your course staff will grade your assignment.” Also, in the Grade column, it shows “Evaluation Pending.”\nI’ve attached a screenshot of the portal for your reference.\nCould you let me know if the evaluation is still in progress or when the marks are expected to be updated?\nThank you for your time and assistance\nBest regards\nSidhi dewan\n@PrernaGupta @Prashant2\nScreenshot 2025-06-04 1107211381×639 40.5 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/extra-activity-1-marks-pending/177836"
  },
  {
    "text": "Guide regarding making Notes Can someone explain/guide how can i make notes?? Should i make notes?? If yes then can i just copy the lectures ppt or i need to do something else?? Someone specially any senior here pls guide.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/guide-regarding-making-notes/178258"
  },
  {
    "text": "Quiz 1 exam city preference not showing WhatsApp 06-06-2025 23_19_321920×1008 87.4 KB\nWhy quiz 1 is not showing here??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/quiz-1-exam-city-preference-not-showing/178091"
  },
  {
    "text": "Doubt in lectures Where Can I ask doubt about the lectures",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-lectures/178045"
  },
  {
    "text": "Thriller Novels Can anyone suggest me some Thriller Novels. I have already read Dan Brown, Jeffrey Archer, Lee Child and quite a few others.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/thriller-novels/41607"
  },
  {
    "text": "Week 3_Lecture 3.2 image1555×700 137 KB\nCan anyone please explain this SQL Query ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-lecture-3-2/178250"
  },
  {
    "text": "The Last Six Months in LLMs [Blog] No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/the-last-six-months-in-llms-blog/178252"
  },
  {
    "text": "Is this enough for completing Milestone 1? I am getting started with the project of MAD-1 and am at this stage. Is this enough to qualify for the milestone 0 for the project? I have also requested for the collaborator to be added to the project besides.\nimage944×522 28.1 KB\nBesides, I’m not sure if this is a blocker of any sort but I have multiple GH accounts and am using different ssh keys for them, alongside different names and emails as needed [using includeIf directives with different .gitconfigs]. It would be nice to get a confirmation that this will not be a problem going ahead.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/is-this-enough-for-completing-milestone-1/177958"
  },
  {
    "text": "Mad Project Is it permissible to use AI tools like GitHub Copilot and VS Code extensions while building projects? Is it considered plagiarism if you use your own logic and take help from them?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-project/178153"
  },
  {
    "text": "Regarding parking time stamp usage parking_timestamp = db.Column(db.DateTime(timezone=True), default=datetime.now(timezone.utc), nullable=False)\nIS THIS CORRECT",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-parking-time-stamp-usage/178225"
  },
  {
    "text": "ER diagram format Instead of crow’s feet notation, can we use cardinality notation for the ER diagram? I generated it from eralchemy and it gave the below kind of format.\nimage622×462 34.2 KB\nI have attached only part of the diagram as I am not sure if I am allowed to attach it before project deadline… Is this okay?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/er-diagram-format/176582"
  },
  {
    "text": "Welcome to the App Dev I Project – MAY 2025 Term! Dear Students,\nWe’re excited to kick off the App Development I Project Course for the May 2025 term! This post will help you get started with everything you need to know and access.\nPlease read through carefully and bookmark the links provided below.\n1. Project Document\nComplete details about the structure, core requirements, and deliverables for the project.\nDocument Link\n2. Valid Project Statement (MAY 2025 Term)\nThis is the ONLY valid problem statement for this term. All submissions must align with this scope.\nProject Statement Link\n3. Milestones Document\nTrack your progress through clearly defined checkpoints and deadlines.\nMilestones Document Link\n4. General Information Document\nContains general policies, submission guidelines, FAQs, and support channels.\nGeneral Info Document Link\n5. Live Session Details\nWeekly live sessions to guide your development and clear doubts.\nEvery Monday, 4:00 PM – 6:00 PM (from 16th June)\nGoogle Meet: https://meet.google.com/rin-ogcd-qwr\n6. YouTube Playlist\nRecording of the Orientation Session and live sessions of this term will be available here.\nYouTube Playlist Link\n7. GitHub Repo for the code base of project built in the live sessions\nBelow is the GitHub Repo where all the code created, and relevant document used in the project sessions will be pushed.\nGitHub Repo (to be updated)\n8. YouTube Playlist of Previous Term (Jan 2025)\nRecording of the live sessions held in last term are available here.\nYouTube Playlist link\n9. Viva Workflow Portal\nAll viva submissions and evaluations will be managed here.\nViva Portal Link\n10. Git Tracker Document\nThis document includes steps to create a private git repository and add official app dev IDs as collaborators.\nGit Tracker Document\n\nSubmission Timeline\nBatch 1: 10 June – 30 June 2025\nBatch 2: 1 July – 15 July 2025\nBatch 3: 16 July – 30 July 2025\nFinal Submission Deadline: 30 July 2025, 11:59 PM IST (No extensions)\n\nNeed Help? Tag Us!\nFor any queries, please tag your Instructors and TAs:\nInstructors:\nShivani varma: @shivani28\nShri krishna Pandey @shri_krishna_pandey\nSatyanarayana S @satyanarayana\nAdarsh Madre @AdarshMadre\nTAs:\nUrjaswi Banerjee @22f3000877\nDevam Shah @devam_07\nHappy learning and developing!\n- App Dev Team",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/welcome-to-the-app-dev-i-project-may-2025-term/175907"
  },
  {
    "text": "TDS project 1,I face ambiguati to make this project,how can I start? pleas help me for make this project1,in tooi in datascience",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-project-1-i-face-ambiguati-to-make-this-project-how-can-i-start/154294"
  },
  {
    "text": "AQ 2.3 (Maths 2) T122W2-2455×431 26.7 KB\nQ. Match the matrices in Column A with their inverses in Column B.\nCorrect answer:\na → i\nb → iii\nc → i\nI am stuck on this question and not sure how A1 is calculated? Clarifying A2 and A3 would be helpful too.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/aq-2-3-maths-2/178245"
  },
  {
    "text": "Practice Assignment_Week 2 image1668×403 45.9 KB\nHow 4th option is also correct ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/practice-assignment-week-2/178238"
  },
  {
    "text": "SQL Query_Week 2 image761×544 141 KB\nSELECT s.student_fname,s.student_lname\nFROM students as s\njoin departments as d\non d.department_code = s.department_code\nwhere d.department_name = \"PG\"\n\nI have tried this code, but it is giving me an error, Please correct me. @Manidipa2001",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sql-query-week-2/178241"
  },
  {
    "text": "Acenture internship real or not? Continuing the discussion from Regarding Wipro training and internship:\n10000160441080×6644 458 KB\nGUYS I GOT MAIL FROM IIT MADRAS like it is mandatory is this scam too?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/acenture-internship-real-or-not/177961"
  },
  {
    "text": "About graded assignment If i did not score full in graded assignment will my credit reduce",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/about-graded-assignment/178239"
  },
  {
    "text": "Dbms oppe date clarification How to know if dbms oppe is on 17th or 24th aug?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/dbms-oppe-date-clarification/178234"
  },
  {
    "text": "Maths 2 activity 2.3 Q1 image1118×552 28 KB\nThe above is the correct gauss jordon done by TA ,\nimage1152×1536 145 KB\nthis one was done by me ,   but it seems I did correct operatiosn, though my inverse doesn’t match , can someone confirm whether can we only use 3rd elementary row op in this method?  can anyone plz find any mistakes in my approach n let me know ,   @deepbist",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/maths-2-activity-2-3-q1/178210"
  },
  {
    "text": "DBMS Wk 3 PQ 3 My SQL is :              SELECT f.faculty_fname, f.faculty_lname\nFROM faculty f\nJOIN members m ON f.id = m.id\nWHERE NOT EXISTS (\nSELECT *\nFROM book_issue bi\nWHERE bi.member_no = m.member_no\n)\nwhy it is giving\nIncorrect select query                                                                                                         Please help.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/dbms-wk-3-pq-3/178209"
  },
  {
    "text": "Issues in week 1 graded assignment In the week 1 graded assignment in computational thinking, we can only select one option for the multiple choice question. Did anyone else face this issue? Does anyone know how to rectify this?\nUntitled1433×535 57.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/issues-in-week-1-graded-assignment/178211"
  },
  {
    "text": "Issues in week 1 ct graded asignment In the week 1 graded assignment in computational thinking, we can only select one option for the multiple choice question. Did anyone else face this issue? Does anyone know how to rectify this?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/issues-in-week-1-ct-graded-asignment/178204"
  },
  {
    "text": "Admission into the gchat of Wayanad house Hey everyone ,\nI was actually allotted the Wayanad house .  But I am not yet admitted to the gchat of Wayanad house . Can anyone please inform the procedure to join the gchat and any other groups whichever are there for the house .\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/admission-into-the-gchat-of-wayanad-house/178103"
  },
  {
    "text": "Persistent Issue Accessing Course Page Screenshot 2025-06-07 1841541600×900 40.9 KB\nI’ve been consistently facing an issue while trying to access my course page. Each time I open it, the page either fails to load initially or requires 5–6 reloads before it finally opens. This has been happening regularly.\nI’ve already tried the following steps to troubleshoot:\n\nVerified that my internet connection is stable.\nSwitched browsers.\nUsed incognito/private mode.\n\nUnfortunately, none of these have resolved the problem. In some cases, the course page doesn’t load at all.\nI would appreciate it if you could look into this issue at your earliest convenience.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/persistent-issue-accessing-course-page/178152"
  },
  {
    "text": "Attending Live sessions I am having doubts regarding attending live doubt sessions.\n• how will I get notified that there will be live sessions.\nIs there any help centre on iitm bs website, where I can ask my queries.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/attending-live-sessions/178185"
  },
  {
    "text": "Doubt in Week 1 concept (Make sure that you have applied a tag while posting. Use the below template while posting your queries in the forum. Both these actions from your end will help the course instructors and peers to address your query more effectively. You can remove this portion while posting your query)\nMy specific doubt is on the topic: Python recap (computing gcd of 2 nos.)\nMy doubt is: It has been mentioned in one of the video lectures that-\n\nthe time taken by a program to compute gcd using 1st approach is proportional to the max of the 2 nos.\nthe time taken by a program to compute gcd using 2nd approach is proportional to the number of digits in the max of the 2 nos.\nimage427×237 39.1 KB 1st approach\nimage419×226 39.7 KB 2nd approach\n\nHowever, finding a counter-examples as the pairs (18, 27) and (18, 36), I found-\n\nusing the 1st approach, it took me more number of steps to compute gcd(18, 27) than it took to compute gcd(18, 36) whereas 36>27 (comparing the maximum of both pairs).\nthe same goes for the 2nd approach where the no.of digits(36)= no.of digits(27).\n\nI am sure there could be more such counter-examples. Looking forward to the clarification of query.\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-week-1-concept/177538"
  },
  {
    "text": "Type of university to be selected for IITM image1920×1080 206 KB\nFrom the given options, what should I select for IIT Madras under type of institution/university/college?\nA prompt reply is highly appreciated.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/type-of-university-to-be-selected-for-iitm/178114"
  },
  {
    "text": "Important Resource for Degree Level Courses Last term I shared all the diploma level course slides, transcript, GA, PA, book and any other useful material. Now I want make same for degree level courses. Please share useful material that will all the fellow students.\n\n\n\n\nCourse Name\nCourse Code\nLecture Playlist\nSupplementary Content\nCourse Channel\n\n\n\n\nStrategies for Professional Growth\nGN3001\nlink\nlink\nChannel\n\n\nSoftware Engineering\nCS3001\nlink\nlink\nChannel\n\n\nSoftware Testing\nCS3002\nlink\nlink\nChannel\n\n\nAI: Search Methods for Problem Solving\nCS3003\nlink\nlink\nChannel\n\n\nDeep Learning\nCS3004\nlink\nlink\nChannel\n\n\nAlgorithmic Thinking in Bioinformatics\nBT4001\nlink\n\nChannel\n\n\nBig Data and Biological Networks\nBT4002\nlink\nlink\nChannel\n\n\nData Visualization Design\nCS4001\nlink\nlink\n\n\n\nSpecial topics in Machine Learning (Reinforcement Learning)\nCS4002\nlink\nlink\nChannel\n\n\nSpeech Technology\nEE4001\nlink\nlink\n\n\n\nDesign Thinking for Data-Driven App Development\nMS4002\nlink\nlink\nChannel\n\n\nMarket Research\nMS3002\nlink\nlink\nChannel\n\n\nIndustry 4.0\nMS4001\nlink\nlink\n\n\n\nPrivacy & Security in Online Social Media\nCS4003\nlink\nlink\nChannel\n\n\nIntroduction to Big Data\nCS4004\nlink\nlink\n\n\n\nFinancial Forensics\nMS4003\nlink\nlink\nChannel\n\n\nLinear Statistical Models\nMA3012\nlink\nlink\n\n\n\nAdvanced Algorithms\nCS4021\nlink\nlink\nChannel\n\n\nStatistical Computing\nMA3014\nlink\nlink\nChannel\n\n\nComputer Systems Design\nCS3031\nlink\nLink\n\n\n\nProgramming in C\nCS3005\nlink\nLink\nChannel\n\n\nMathematical Thinking\nMA2001\nlink\nLink\n\n\n\nOperating System\nCS4022\nLink\nLink\nChannel\n\n\nLarge Language Models\nCS5001\nLink\nLink\n\n\n\nIntroduction to Natural Language Processing (i-NLP)\nCS5002\nLink\nLink\n\n\n\nDeep Learning for Computer Vision\nCS5003\nCourse Website\nLink\nChannel\n\n\nManagerial Economics\nMS3033\nLink\nLink\n\n\n\nGame Theory and Strategy\nMS4023\nLink\nLink\n\n\n\nCorporate Finance\nMS3034\nLink\nLink\n\n\n\nDeep Learning Practice\nDA5013\nLink\nLink\nLink\n\n\nMachine Learning Operations (MLOps)\nDA5001\nLink\n\nLink\n\n\nGenerative AI\nDA5002\nLink\n\n\n\n\nAlgorithms for Data Science (ADS)\nDA5003\nLink\n\n\n\n\n\n\nIf you find any error/ problem please comment here, I will try to correct that.\nIf you have materials for other courses please share it here.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/important-resource-for-degree-level-courses/85946"
  },
  {
    "text": "Guidance for pursuing this course Hi all!\nThis is Shree Bohidar. I have joined recently (May Term 2025).\nCan someone suggest a proper way to study? Like how & where to start, what should be the weekly target? How often to give practice assignments? And anything else you think is important for us to know.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/guidance-for-pursuing-this-course/177491"
  },
  {
    "text": "Resources sharing website Lets Collect Good Resources at One place\nMany times I spent hours scrolling on youtube in search of some topic taught in our course, while sometimes I get just on one search. As for all of us the videos shown on youtube are not same on first search. It will be better if we store any nicely explained youtube video or a article or some website reference for a certain topic taught in out lectures in a website like this. This will collectively benefit all of us and save our time and reduce screen time.\niitm-resources.vercel.app\nA platform for IITM BS in Data Science and Applications students to share learning resources\nIt is stressful to watch one by one videos on youtube and finding some video which is relevant to topic I am searching. This is really a long and iterative task I do for almost every subject expect some good taught courses.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/resources-sharing-website/172818"
  },
  {
    "text": "Discrepancy in Week 2 GrPA results I have verified and submitted answers for Week 2 GrPA but for all received 0.0.\nAlso submitted answer for GrPA 4 but it is showing as Absent.\nimage3808×2041 401 KB\nCan this be re-evaluated or can someone let me know if I am doing anything wrong.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/discrepancy-in-week-2-grpa-results/177558"
  },
  {
    "text": "Regarding Discourse Rewards How cool it would be , if we would have some rewards ( whatever) , for providing 100 solutions or lets say receiving 1k likes on your posts .  Would be fun and keep many more engaged adding to the community .\nPS:  Anand sir will have all the loots",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-discourse-rewards/160748"
  },
  {
    "text": "Graded Assignment Programming Hi, When i execute the Week3 Graded Question - SQL query , all Public test cases pass 100%, However Private test cases show 0%. Will it be evaluated only after the Deadline ? Kindy confirm",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-programming/178106"
  },
  {
    "text": "Graded Assignment Date for Week1 and Week2 on the same date Hi, the Submission Date for Assignment 1 was 25th May , now i see the date has passed for Assignment Week 2 as well.Apparently both are on the same date. I assumed that it is a weekly assignment . I missed Week2. This week there are no assignments, which is very strange.Kindly help\nMy specific doubt is on the topic: Submission Date for Week 2 Assignment\nMy doubt is: \n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-date-for-week1-and-week2-on-the-same-date/176538"
  },
  {
    "text": "Doubt in Week2| PA| Q no.2 image514×443 19.2 KB\nCan someone please explain how to solve this question.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-week2-pa-q-no-2/177736"
  },
  {
    "text": "Editing quiz 1 city pref When is the last date for editing quiz 1 city?\nAm unable to find the option.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/editing-quiz-1-city-pref/178073"
  },
  {
    "text": "Got a mail regarding internship Final reminder for IIT Madras Distant Program students internship registration - 25f2001633@ds.study.iitm.ac.in - Indian Institute of Technology Madras Mail - Google Chrome 06-06-2025 19_34_571920×1008 113 KB\nI know its scam/fake, But still can anyone confirm it??  and why IITM is leaking our details??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/got-a-mail-regarding-internship/178069"
  },
  {
    "text": "Are there any Dipsites here? No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/are-there-any-dipsites-here/178057"
  },
  {
    "text": "Live session related doubt I am new joining this course , i miss 1st week live classes of CT in dashboard i got only 1 recorded session for 1st week but calendar there 3 classes are scheduled,  so what should i do now",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/live-session-related-doubt/178055"
  },
  {
    "text": "Exam centre change I have recently secured an internship in Bangalore and am planning to relocate there for the next two months. I would like to change my exam centre for Quiz 1 and Quiz 2 from Delhi to Bangalore. Is this possible now?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/exam-centre-change/178050"
  },
  {
    "text": "Unable to change username to Student ID in github image1139×746 40.9 KB\nplease help me out with this anyone",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unable-to-change-username-to-student-id-in-github/178042"
  },
  {
    "text": "Regarding Quiz No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-quiz/178031"
  },
  {
    "text": "Weekly Assignment Deadliens Hello, I wanted to ask when the deadlines for the week 4 assignments onwards are, as I have not yet received content for Week 4 onwards on my portal for Maths 2?\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/weekly-assignment-deadliens/178030"
  },
  {
    "text": "Quant Finance Hey guys, I think IITM should introduce a category for finance enthusiasts too. Otherwise we all who are finance enthusiasts (eg quant finance) can make a discussion group for it and make a finance club which would be helpful for all of us mutually in gaining knowledge in the field of finance.\nHoping positive replies from the interested ones!!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/quant-finance/177974"
  },
  {
    "text": "Regarding DBMS OPPE My specific doubt is on the topic: DBMS OPPE\nMy doubt is: I passed OPPE. Cleared Python Question too. I’m not satisfied with the score. Is there any option to improve score without having to go through the entire course again. Can I reattempt OPPE alone in next term?\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-dbms-oppe/172305"
  },
  {
    "text": "Is there any eligibility for Oppe of Database management systems Is there any eligibility for Oppe of Database management systems",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/is-there-any-eligibility-for-oppe-of-database-management-systems/177942"
  },
  {
    "text": "Ubuntu VirtualBox keyboard problem [System Commands] I’m doing a bit of System Commands even though I haven’t taken it this term. So when I installed Ubuntu in VirtualBox something weird is happening with the keyboard, I press one key and the character is printed many times.\nimage801×600 40.4 KB\nCan anyone please help with this?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ubuntu-virtualbox-keyboard-problem/176149"
  },
  {
    "text": "Unable to submit Python Grpa assignments @Manidipa2001\n@umaiyalakshmi\nHello everyone . I just couldn’t submit my week1 Python Grpa because I didn’t understand how to answer and submit. Initially, I thought that the entire code has to be typed and tried doing that by erasing the default code written and it was all futile.\nAfter this, I understood that I had to just type the snippets of code but my week 2 Grpa had many cases (for example: case 1,2,3,4 etc).\nThus, when I typed the code, it displayed all outputs for all test cases in case 1 specifically. I tried resolving it and eventually thought maybe that’s how you submit it but soon realised that my submission was futile and I didn’t get any marks.\nIt’s not that I completely don’t know how to code, but I am unable execute the code there.\nI raised this issue and my concern of being eligible to attend Oppe to the support team who eventually told me to put this on discourse.\nI would appreciate if I receive any help in this matter.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unable-to-submit-python-grpa-assignments/177990"
  },
  {
    "text": "Blessings guys tomorrow is my birthday\ni want all elderly people should wish yamada kun for turning 26.!!\nin short wish me a very happy birthday .\ni want the blessings . loads of blessings. blessings of all .\nso that i top in upcoming exams.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/blessings/177964"
  },
  {
    "text": "MAD 1 week 2 lab assignment Submitted the MAD 1 lab assignment on 28/05/2025 at 11 PM, and the portal showed it as submitted. However, after the deadline, it was observed that the attached file was missing—likely due to a technical issue. The assignment was completed on time and meets all the given specifications.\nAdditionally, there were discrepancies in the test case evaluations, where some test cases didn’t run correctly despite correct logic and output locally.\nThe support team has been mailed with the completed assignment attached, requesting a resubmission option or deadline extension. Sharing here in case others faced a similar issue or have any updates.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-1-week-2-lab-assignment/177984"
  },
  {
    "text": "How to register for Online Boot camp for MAD II project? I want to register for the upcoming online bootcamp, that is, the one scheduled between 1st July to 14th July. I have received no emails regarding the registration, neither I can fine any links on in the guideline document.\nPlease help.\nThanks and regards,\nYash.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/how-to-register-for-online-boot-camp-for-mad-ii-project/177978"
  },
  {
    "text": "Regards got mail for internship I got mail yesterday regards online internship where they are saying 1 month training and 1 month internship asking amount 4k\nI just want to confir whete its scam or genuine\nScreenshot_20250527-131213_Gmail1080×2340 270 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regards-got-mail-for-internship/176491"
  },
  {
    "text": "DIRECT ENTRY TO MASTER’S FROM IIT’s THROUGH THIS IITM BS DEGREE PROGRAM Can anyone explain the process of direct entry for master’s from IIT’s online/offline through this IITM BS Degree Program. Pls Explain Each and Every Details!!!  Thank You!!!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/direct-entry-to-masters-from-iits-through-this-iitm-bs-degree-program/177959"
  },
  {
    "text": "Mad-2 project problem statement query I had registered for MAD-2 project during the last trimester( Jan 2025) but had not submitted the project hence received the I grade. In my project submission page no new dates are updated and new project topics are not shown( only the old ones are shown). Should i make the project for the older/ last term problem statement or this term’s problem statement??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-2-project-problem-statement-query/177741"
  },
  {
    "text": "Workshops at Paradox “Today only, I came to know about workshops at Paradox from its website, but it is not mentioned how to register for those workshops. The Paradox team has also not mentioned it. I want to know how we can register for workshops at Paradox”\n@Karthik_POD Many of my batchmates and I are interested in participating but haven’t received any  emails regarding the registration process. Could you please help  us with information on how to register for these workshops at Paradox?\nScreenshot 2025-05-31 161209566×825 55.5 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/workshops-at-paradox/176785"
  },
  {
    "text": "Marks of GA1 even till not i havent got any email regarding my marks in ga 1\ni submitted that on time also with all my work done.\ni am writing this a bit late as due to emergency at my home i was unable to catch up with the course .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/marks-of-ga1/177878"
  },
  {
    "text": "Dae not visible I registered for slot 2 lab which would fall in june 2025 this month but i still didnt receive the date\ncan anyone please clarify me\ni registered for estc and c proramming lab courses",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/dae-not-visible/177899"
  },
  {
    "text": "Unable to Login Student Email I’d I’m using Google Chrome in Normal Mode and when I login in Course Portal and when I’m trying to Open Course Card to Study the content but I got this which is attached below in image.\n1366×768 22.3 KB\nbut when i try to open in Incognito Mode It will open normally after Login from past some days but today when i try to Sign In after Password it demand OTP from Recovery Email Id after this it show this which is attached below in image.\n535×769 29.7 KB\nSo, how i Login in this because my Study is stopped because of this.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unable-to-login-student-email-id/177927"
  },
  {
    "text": "Lost data in laptop while working on Git bash while solving the 18th question\nDownload q-list-files-attributes.zip and extract it. Use ls with options to list all files in the folder along with their date and file size.\nWhat’s the total size of all files at least 16 bytes large and modified on or after Fri, 18 Jul, 1997, 4:43 am IST?\ni even cant recall that what exactly code i wrote in git bash due to which this happened as i  was trying many times …\nbut i think i did some mistake with directory selection again i am not very sure as  simultaneously i was also working on  powershell and colab…\nmy data in downloads desktop documents is completely lost …its completely blank\nplz if  anyone have any idea to retrive my data please do support…i was having many important documents there.. .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/lost-data-in-laptop-while-working-on-git-bash/175382"
  },
  {
    "text": "Query regarding ID card I didn’t receive my ID Card. I have checked in the “Documents for download” but it is not there. When will I get it? Or will it take time? Does anyone received the ID card?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-id-card/177930"
  },
  {
    "text": "Best Numpy Resource BEST NumPy RESOURCE  AayushKotwani3/Numpy-masterclass: Comprehensive hands-on notes, examples, and exercises to master NumPy from basics to advanced.\nThis is the resource I’ve been talking about — and trust me, it’s one of the best NumPy masterclasses you’ll come across! \n Who Is This For?\n Beginners who want to learn NumPy from scratch\n Intermediate users looking to revise thoroughly\n Anyone preparing for interviews with NumPy-based questions\nYes — it’s for everyone, from beginner to advanced. Every concept is covered with clarity and code!\n What’s Inside?\n Topic-wise folders\n Clean, well-written markdown explanations\n Practical, hands-on code snippets\n A structured learning path in the main README file\n Star the repo so you always have it with you.\n Share it with your friends — I’ve curated everything I could think of to make learning NumPy simple, practical, and powerful.\nFeel free to raise issues, suggest improvements, and let me know what you think! Let’s grow together \n5356×771 10.8 KB\n41325×877 40.3 KB\n3580×872 37.7 KB\n2938×901 38.2 KB\n11187×747 44.1 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/best-numpy-resource/177928"
  },
  {
    "text": "Python grpa while test running code in python week 3 grpa 1 it says something went wrong ,i have tried refreshing, logging out and logging back in..it still doesn’t work.\n@livin @kubra_7\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-grpa/177739"
  },
  {
    "text": "Vue.js 2 or 3? Lectures Use 2, but It’s Outdated Vue.js 2 feels quite outdated now, but the lectures we’re following are still based on Vue.js 2.\nShould we stick with that, or go ahead and learn Vue.js 3 on our own?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/vue-js-2-or-3-lectures-use-2-but-it-s-outdated/176797"
  },
  {
    "text": "Axios usage can Axios be used instead of fetch?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/axios-usage/176724"
  },
  {
    "text": "Doubt regarding JavaScript assignment Hello sir, Good evening\nI want to tell that the question for MAD 2 week 1&2 JavaScript assignments was not visible , I could only see the overview and test cases, on clicking the question tab, just the heading and a blank page  appeared. Firstly, I wrote a mail regarding this issue to the 'support ’ I also shared the screenshot to them, then they replied that i should raise this issue in the discussion forum . As a result I was not able to submit the week 1&2  JavaScript assignments .\nWhat should I do ?\nScreenshot 2025-06-05 1148061425×752 46.3 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-javascript-assignment/177913"
  },
  {
    "text": "TA’s recording session of math-2 week 3 TA session  of mathematics 2 recording did not upload yet in the google sheet.\nkindly upload the recording session.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/tas-recording-session-of-math-2/177912"
  },
  {
    "text": "Updates on Python OPPE SCT Hi everyone,\nDoes anyone have any updates on when the Python OPPE SCT results are expected to be announced? If you’ve heard anything official or have any insights, please do share.\nThanks in advance!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/updates-on-python-oppe-sct/177896"
  },
  {
    "text": "IITM Paradox hello everyone,\ni hope yall enjoying u r time in paradox\njust a small request from my side to the students in iitm currently if u can ask one question if possible to the team heading this bs degree\ny this degree doesnt have 162 credits like a typical four year degree has if they increase it from 142 it can help a lot of students. firstly students can take more courses which might be taught in core cs aiml branch and also gain more knowledge in some other courses as well , also some masters might require to complete more credits than the credits this degree has. if u can and get some answers from them as noone answers when i tag them here in discourse, might be they are busy with their hectic schedule but  if u can ask them it would be great\nthank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/iitm-paradox/177883"
  },
  {
    "text": "Need a Self Help/Growth Book Recommendations No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/need-a-self-help-growth-book-recommendations/116695"
  },
  {
    "text": "Assistance Required: Correction of Submitted Admission Document I am writing to bring to your attention an error I made during the document submission process for admission. I inadvertently uploaded my caste certificate in place of the required income certificate.\nI sincerely apologize for this mistake and kindly request your guidance on how I may rectify it by submitting the correct document. I have attempted to contact the administration regarding this issue but could not contact. I am writing to bring to your attention an error I made during the document submission process for admission. I inadvertently uploaded my caste certificate in place of the required income certificate.\nI shall be highly oblighed if any kind hearted person kindly help in to resolve this issue.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/assistance-required-correction-of-submitted-admission-document/177860"
  },
  {
    "text": "House allocation status Hey , I just joined the foundation level and got my credentials a week back but I have no idea about my house allocation status . Is there any form to apply for house allocation . If yes , then can anyone please share it .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/house-allocation-status/177863"
  },
  {
    "text": "URGENT CLARIFICATION NEEDED - Wrong photo in sct form! Hello,\nI made a mistake and uploaded the wrong photo of 3rd person view in the sct final form. The form is closed what to do? I wrote to the support. But what should I do? should I just make it right on the 2nd window? on june 14th",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/urgent-clarification-needed-wrong-photo-in-sct-form/176810"
  },
  {
    "text": "I have missed peer review stat-2 week 1, request for Due date extention No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/i-have-missed-peer-review-stat-2-week-1-request-for-due-date-extention/176830"
  },
  {
    "text": "Https://exam.sanand.workers.dev/project-tds-virtual-ta-promptfoo.yaml is not opened The URL https://exam.sanand.workers.dev/project-tds-virtual-ta-promptfoo.yaml is currently not accessible.\"",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/https-exam-sanand-workers-dev-project-tds-virtual-ta-promptfoo-yaml-is-not-opened/177666"
  },
  {
    "text": "Regarding Sct how to know that  my sct is succesfully done.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-sct/177806"
  },
  {
    "text": "How to change the pace of course I have mistakenly selected 4 subjects in 1st term and want to change it to 2 subjects in one term",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/how-to-change-the-pace-of-course/177718"
  },
  {
    "text": "Week 3 Assignments due date clarification Can someone officially confirm the due dates for this week’s (Week 3) assignments please?\nI see on the page 25th Jun. But usually we submit on the wednesday of each week rite? is it because of Paradox? I haven’t received any mails about this as well.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-assignments-due-date-clarification/177763"
  },
  {
    "text": "Week1 GrPA(3-5) test cases error My specific doubt is on the topic: GrPA Assignment test cases error.\nMy doubt is: According to the question, the code is correct; however, when the test cases are run, it is not picking up the right code for the right answer. For example, the test case for output 1 is taking the code of output 4.\n\nRecommended:\nMention what you have done till now to find clarification on the doubt: I’ve tried running my code on Python to see if my code has any errors; however, the issue is just that the test case is not picking up the right code for the right question.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week1-grpa-3-5-test-cases-error/176778"
  },
  {
    "text": "GA3 - Large Language Models - Discussion Thread [TDS May 2025] Please post any questions related to Graded Assignment 3 - Development Tools.\nPlease use markdown code formatting (fenced code blocks beginning with ```) when sharing code (rather than screenshots). It’s easier for us to copy-paste and test.\nDeadline: \nJune 1, 2025\n@Jivraj @Saransh_Saini @HritikRoshan_HRM @21f3002441 @iamprasna @carlton",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga3-large-language-models-discussion-thread-tds-may-2025/175592"
  },
  {
    "text": "Which subject to choose in jan term Hii all…i know this may not be the correct platform to ask this question.\nActually i have 3 diploma subjects to cover - MLP, JAVA, TDS. So which 2 subject should i choose for this term?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/which-subject-to-choose-in-jan-term/161071"
  },
  {
    "text": "Statistics-2/GA2/Q3 Could you please explain answer for this question.\nimage679×345 22.7 KB\nMy specific doubt is on the topic:\nimage949×379 44.6 KB\nimage910×489 39.4 KB\nimage829×362 33.6 KB\nMy doubt is:  Please explain marked step.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/statistics-2-ga2-q3/177749"
  },
  {
    "text": "Wrong grading of my week 1 programming with python assignment My specific doubt is on the topic: Wrong grading of my marks\nMy doubt is: Why I got only 44 marks in my week 1 graded assignment of programming with python when I only got only 4 questions wrong which amount to a total of 4 points\n\nRecommended:\nI also wrote a mail to the support team, and they told me to write about my problem on the discourse forum so please tell me what I should do now.\nWhatsApp Image 2025-06-03 at 22.55.22_358d41ad1600×1200 241 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/wrong-grading-of-my-week-1-programming-with-python-assignment/177748"
  },
  {
    "text": "My score is wrong on the page My all questions of graded assignment is right but still i am getting 95 , i have checked the graded assignment 5 times but each answer is correct and i am getting full marks .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/my-score-is-wrong-on-the-page/177372"
  },
  {
    "text": "Graded Programming Assignment missed due to the technical glitch in official website I am student of bs data science, foundation level.Past few days, I was out of station and was unable to open the contents of the course,on day of assignment submission, I was able to submit assignment of 3 subjects but the site got closed when I was completing GrPa of python and it never opened, due to which I missed week 1 GrPa of python. Now I got to know that I can’t give OPPE 1 as I have missed week 1 grpa due to a technical issue.I want my efforts to go in vain due to a technical glitch in website.\n10000895851220×2712 82.8 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-programming-assignment-missed-due-to-the-technical-glitch-in-official-website/176424"
  },
  {
    "text": "Python Programming Problems Here I will be sharing colab sheets of  programming problems",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-programming-problems/176530"
  },
  {
    "text": "Access of live sessions How can i access the live session. How can I get the meeting link to do so. Please tell me.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/access-of-live-sessions/177731"
  },
  {
    "text": "Late joining hello,\nI am new to all of this. I joined to this course very late I think. I don’t know how to start study and what to do. So please any one can explain in brief",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/late-joining/177705"
  },
  {
    "text": "Additional resources for PDSA My specific doubt is on the topic: Extra resources for PDSA\nMy doubt is: I want to know if we can have the google colab notes link sir used in lectures for reference\nlike share the folder for that google colab notes with iitm mail",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/additional-resources-for-pdsa/177714"
  },
  {
    "text": "Problem in extracting university and eshop dataset No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/problem-in-extracting-university-and-eshop-dataset/176908"
  },
  {
    "text": "MLF | Week wise summary | Brief notes (TA) Hello everyone.\nI have tried to collate my previous TA summaries and the summaries for the rest of the weeks in one place.  I have tried to  keep the summaries in line with what has been covered in the lectures. Further, this collection is intended as revision notes and assumes that you have gone through the lectures first.\n → The collection can be accessed here.\nPlease feel free to provide your valuable feedback in this thread.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mlf-week-wise-summary-brief-notes-ta/158586/3"
  },
  {
    "text": "Activity point on HackerRank My specific doubt is on the topic: Activity point on HackerRank\nMy doubt is: I’m asking some doubts regarding activity point on HackerRank.\nwhen I will updating my activity point in google form. Is it mandatory that the Hackerrank website login with college student email id or personal email id also work ?\nMeaning that whatever task we complete, we will have to complete it by logging in with college email id or even if we do it with personal email id, points will be counted",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/activity-point-on-hackerrank/177699"
  },
  {
    "text": "I am unable to confirm whether my (activity/practice) assignment was submitted When I try to submit my “activity questions’ or 'practice assignment”\n\nI am shown a confirmation box showing my email\nthen I clicked on okay\nI can see my grades\nthe status of assignment on left panel still shows a clock icon\nI try switching to second week’s content, no change\nI refresh the page\nthe clock icon changes to blue dot\nthe grades in the grades tab still shows no update\n\nscreenshots and recordings:\nss1\n\n\" assignment page \"\nss2\n\n“grades page”\nrecording",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/i-am-unable-to-confirm-whether-my-activity-practice-assignment-was-submitted/177692"
  },
  {
    "text": "Live sessions access Can anyone please advice me on how to access the live sessions and the schedule of the same for May Term 2025 ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/live-sessions-access/177691"
  },
  {
    "text": "Study time How many hours to give in 1st of foundation for this course",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/study-time/177668"
  },
  {
    "text": "Syllabus of quiz-1 Kindly help me with syllabus of MLF in quiz-1, quiz-2 and end term. I want to know the breakdown of weeks course. As only till week-2 is covered before 13th June which is quiz-1 date.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/syllabus-of-quiz-1/177685"
  },
  {
    "text": "Clarification about accessing course On my current courses it shows the content of 3 weeks, but i just started classed from 30th May so will i have to complete the content of 3 weeks in just 1 week?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/clarification-about-accessing-course/177334"
  },
  {
    "text": "Doubt regarding scoring of Graded Assignment and GrPA My specific doubt is on the topic: Grading of Assignments and GrPA for term2-2025\nMy doubts are :\n\nWhy are Assignments graded out of arbitrary numbers much larger than 100?\nMy scores are not matching. Subject dashboard shows my Week 1 GA as 126 while overall dashboard shows 88. I am pretty sure 126 is the highest achievable score in that assignment.\nIs there partial marking/ manual checking in GrPA for students whose test cases didn’t pass? I wrote half code 5/10 required for week 1 GrPA 5. It shows 0 marks and says under evaluation.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-scoring-of-graded-assignment-and-grpa/177664"
  },
  {
    "text": "Collaboartor not accepting my invitation No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/collaboartor-not-accepting-my-invitation/177285"
  },
  {
    "text": "My github invite request still pending since 10 days image1511×905 50.3 KB\nStill my github invite is pending .If i done something wrong then tell me , since 10 days my invite request is pending . Course team replied that it will be accepted in batches , but still its taking too long and i am worried. most of people facing same issues ,and i seen people also that got accepted also .\nI hope course team will address this issue.\nmail:23f2005464@ds.study.iitm.ac.in",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/my-github-invite-request-still-pending-since-10-days/177645"
  },
  {
    "text": "Python oppe repeat (Make sure that you have applied a tag while posting. Use the below template while posting your queries in the forum. Both these actions from your end will help the course instructors and peers to address your query more effectively. You can remove this portion while posting your query)\nMy specific doubt is on the topic: \nMy doubt is: I OPTED FOR REPEAT OPPE ONLY,\nSo should I do the weekly assignments, or will I be able to write the OPPE exams?\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-oppe-repeat/176606"
  },
  {
    "text": "Lets Introduce Ourselves? Hello Guys\nMyself Shaurya from Chandigarh, India. I am currently in my third year of Electronics Engineering at BITS Pilani Goa. Besides this I am a full stack web developer. I like to play chess in my free time and I am a professional Bhangra dancer too. Looking forward to interact with you all and make this place productive for everyone. Cheers!!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/lets-introduce-ourselves/1594"
  },
  {
    "text": "MAD1 Project Bootcamp link Can anyone please send me the registration link for the mad1 project online bootcamp starting from 1st july to 14th july?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad1-project-bootcamp-link/177611"
  },
  {
    "text": "Mtech admission eligibility in IITs IISC I will complete all requirements for the four-year B.S in data science at IITM by May 2026, having accelerated my coursework to finish in three years. IITM will issue a provisional degree certificate in May 2026, while the original degree will only be awarded in may 2027. I plan to take GATE 2026 and apply for M.Tech admission to MTech for the  2026 intake.\nCould you please confirm whether:\n\nI may join in  2026 on the strength of my provisional certificate, even though the original degree will be available only in  2027?\nIf no extension is possible, would I need to defer my admission to August 2027 once the original degree is issued?\n\nThank you for your guidance.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mtech-admission-eligibility-in-iits-iisc/177567"
  },
  {
    "text": "Query regarding Python Grpa submission Hello everyone . I just couldn’t submit my week1 Python Grpa because I didn’t understand how to answer and submit. Initially, I thought that the entire code has to be typed and tried doing that by erasing the default code written and it was all futile.\nAfter this, I understood that I had to just type the snippets of code but my week 2 Grpa had many cases (for example: case 1,2,3,4 etc).\nThus, when I typed the code, it displayed all outputs for all test cases in case 1 specifically. I tried resolving it and eventually thought maybe that’s how you submit it but soon realised that my submission was futile and I didn’t get any marks.\nIt’s not that I completely don’t know how to code, but I am unable execute the code there.\nI raised this issue and my concern of being eligible to attend Oppe to the support team who eventually told me to put this on discourse.\nI would appreciate if I receive any help in this matter.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-python-grpa-submission/176799"
  },
  {
    "text": "Query regarding weekly Python Grpa submission Hello everyone . I just couldn’t submit my week1 Python Grpa because I didn’t understand how to answer and submit. Initially, I thought that the entire code has to be typed and tried doing that by erasing the default code written and it was all futile.After this, I understood that I had to just type the snippets of code but my week 2 Grpa had many cases (for example: case 1,2,3,4 etc).Thus, when I typed the code, it displayed all outputs for all test cases in case 1 specifically. I tried resolving it and eventually thought maybe that’s how you submit it but soon realised that my submission was futile and I didn’t get any marks.It’s not that I completely don’t know how to code, but I am unable execute the code there.I raised this issue and my concern of being eligible to attend Oppe to the support team who eventually told me to put this on discourse.I would appreciate if I receive any help in this matter.\n@piyushw\n@salim0986\nPlease help me resolve this issue. Thank youu.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-weekly-python-grpa-submission/177594"
  },
  {
    "text": "What is possible if det=0 if we have nxn matrix then…\nwhich one is correct\na) if det=0 then sum of elements of row(column) is zero\nor\nb) if sum of elements of rows(column) =0 then the det=0\nor none is correct it depends on matrices?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/what-is-possible-if-det-0/176970"
  },
  {
    "text": "GA2 - Deployment Tools - Discussion Thread [TDS May 2025] Without resizing, image size isn’t going below 800 bytes",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deployment-tools-discussion-thread-tds-may-2025/173525/51"
  },
  {
    "text": "MBA At IIT Delhi For admission in MBA at IIT Delhi, there is extra 6 marks if a candidate graduate from Institute of Eminence in Shortlisting Index Score. So if I have completed this BSc program in Data Science from IIT Madras, is it countable/applicable for me as well ?\nimage730×507 61.2 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mba-at-iit-delhi/98784"
  },
  {
    "text": "Need improvement in navigating this chat forum Need improvement in navigating this chat forum for new users becoz its too complicated to use the portal and need tutorial for using TOOLS and the range of benefits which i can use in this forum .In addition to that UI/UX(USER EXPERIENCE) is quite difficult to feel the ease of portal for new users.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/need-improvement-in-navigating-this-chat-forum/177480"
  },
  {
    "text": "Why always it asks request access image858×490 41.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/why-always-it-asks-request-access/176690"
  },
  {
    "text": "TA sessions mandatory? Are the TA sessions mandatory? Because of college and exams I am not being able to attend any.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ta-sessions-mandatory/176784"
  },
  {
    "text": "Plz help with some suggestions.. Life seems ending No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/plz-help-with-some-suggestions-life-seems-ending/162241"
  },
  {
    "text": "Discourse New User Guide Hello everyone,\nAs we have more learners exploring the forum, here is a post that you should all bookmark  for understanding the different features available in this forum. The post will redirect you to the Discourse Meta Site and we haven’t made any changes in the formatting options. In case you observe any changes/discrepancies please do alert us about them.\n\n\n\nDiscourse Meta – 27 Jul 23\n\n\n\n\nDiscourse New User Guide\n\n\n\n\ndocumentation\n\n\n\n\n\nusers\n\n\n\n\n\n\ngetting-started\nreference\n\n\n\n\n\nWelcome! As a new user of Discourse, we hope you will find this site intuitive and clearly structured, but here is some guidance to get you started:  Basic Terms Used by Discourse (Nomenclature) Here are some very basic terms that will be helpful...\n\nReading time: 26 mins 🕑\nLikes: 175 ❤\n\n\n\n\n\n\nAnd if you find this very long to read and want to explore on your own, why don’t you check the greetings from Discobot available in your notifications (see the screenshot below to get an idea of the message).\nDiscobot_Greetings838×402 37.3 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/discourse-new-user-guide/3296"
  },
  {
    "text": "Why is V3 not a vector space image700×151 15.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/why-is-v3-not-a-vector-space/176959"
  },
  {
    "text": "Activity points on-Machine Learning Techniques Hi,\nCould you please clarify when we will be able to perform the following activities?\nAre they available under the MLT section of the IITM Online under my dashboard?\nAlso, could you kindly elaborate on what these activities involve?\nimage1594×1216 67.1 KB\nThanks & Regards,\nRanadeep Basak",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/activity-points-on-machine-learning-techniques/177307"
  },
  {
    "text": "Regarding SCT exam T2 2025 I was out of station for some important reason Because of which I was not able to give SCT on time ,But I gave it in a hurry, after the deadline I made some mistakes because I was in a hurry .\nI want to give it again , can i get another chance.\n@PiyushW @Nalini @Manidipa2001 @22f3000605",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-sct-exam-t2-2025/177291"
  },
  {
    "text": "Doubt regarding SCT approval and Week 3 graded assignments deadline (Make sure that you have applied a tag while posting. Use the below template while posting your queries in the forum. Both these actions from your end will help the course instructors and peers to address your query more effectively. You can remove this portion while posting your query)\nMy specific doubt is on the topic: SCT Approval and Week 3 assignments deadline.\nMy doubt is: Hello. I am repeating Intro to python this semester and I can see that my SCT AND OPPE approval is reflecting ‘1’ ( approved ). So I guess I do not need to take the SCT again right? As my previous semester’s SCT is going to work. Please confirm this.\nAnd also, I just checked the Week 3 graded assignments deadline which is showing 25th June. Is it correct? As I think it 25th June is too far than the usual deadline time period. Please clarify on these two topics.\n\nRecommended:\nMention what you have done till now to find clarification on the doubt:",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-sct-approval-and-week-3-graded-assignments-deadline/177228"
  },
  {
    "text": "Humble Request to Upload Weekly Content During the Break @Karthik_POD sir\nI just wanted to make a small request — if possible, could you please upload the weekly course content during the break as well?\nI’m not asking to change any deadlines or to conduct live sessions. if possible, the content can be uploaded weekly like usual so that we can continue our studies regularly.\nonly around 20–30% of students are attending Paradox. Those who are not going may still want to make use of this time to study. I understand that the lectures are available on YouTube, but studying through the portal is much more convenient and effective, as each lecture is followed by AQ and PA that really help reinforce our understanding.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/humble-request-to-upload-weekly-content-during-the-break/176634"
  },
  {
    "text": "Missed SCT Exam I missed my SCT Because I don’t have webcam based system, Now I arrange that. May I got one more chance to attend the SCT Exam? @umaiyalakshmi",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/missed-sct-exam/177189"
  },
  {
    "text": "Missed SCT Exam I sincerely apologize for missing my SCT exam due to my own negligence. I understand the importance of this exam and am aware that I am not currently eligible to proceed. I am seeking your guidance and support in addressing this issue and exploring any possible options for eligibility. @pds_staff",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/missed-sct-exam/177117"
  },
  {
    "text": "GA3 - Large Language Models - Discussion Thread [TDS Jan 2025] Please post any questions related to Graded Assignment 3 - Large Language Models.\n\nImportant Instruction\nPlease use markdown code formatting (fenced code blocks) when sharing code in Discourse posts. This makes the code much easier to read and differentiate from non-code text. It also makes it easier for people to copy code snippets and run it themselves. See below code for example\nping exam.sanand.workers.dev\n\nPinging exam.sanand.workers.dev [104.21.31.149] with 32 bytes of data:\nReply from 104.21.31.149: bytes=32 time=9ms TTL=58\nReply from 104.21.31.149: bytes=32 time=8ms TTL=58\nReply from 104.21.31.149: bytes=32 time=8ms TTL=58\nReply from 104.21.31.149: bytes=32 time=9ms TTL=58\n\nPing statistics for 104.21.31.149:\n    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),\nApproximate round trip times in milli-seconds:\n    Minimum = 8ms, Maximum = 9ms, Average = 8ms\n\nVisit this link for more details: Extended Syntax | Markdown Guide.\nA friendly suggestion: kindly go through Discourse Docs! \n\nDeadline: \nSunday, February 2, 2025 11:59 PM\n@carlton @Jivraj @Saransh_Saini",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga3-large-language-models-discussion-thread-tds-jan-2025/163247"
  },
  {
    "text": "Accessing the application No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/accessing-the-application/177121"
  },
  {
    "text": "Error for Vector Databases (1 mark) Hi ,\nI am getting the following error \"{‘error’: {‘message’: ‘You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.’, ‘type’: ‘insufficient_quota’, ‘param’: None, ‘code’: ‘insufficient_quota’}}\nPlease help.\nThanks\nRanadeep",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/error-for-vector-databases-1-mark/176823"
  },
  {
    "text": "Discrepancy in Score My specific doubt is on the topic: PDSA Score\nMy doubt is: Week1 GA Score for PDSA is wrong\n\nThe score on my courses page shows week 1 GA as 46 but when I calculate the marks it’s 91",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/discrepancy-in-score/176857"
  },
  {
    "text": "Puzzle 1! Puzzles have their place too!\nPuzzle-1 (Easy)\nThe fun and interesting part about the puzzle is that you find the solution first, and then crack the logic.\nThe puzzle:\nPuzzle11525×1149 27.5 KB\nYour goal is to place the numbers 1 to 8 in the boxes so that no two consecutive numbers sit in adjacent cells — horizontally, vertically, or diagonally.\nExample- If you place 6 in box D, then 5 and 7 cannot be placed in any adjacent boxes (A, B, C, E, G).\nDon’t forget to share whether you figured out the solution first or the logic behind it!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/puzzle-1/174859"
  },
  {
    "text": "Textbooks for MLF Hello everyone, can anyoneone tell where can I find the prescribed textbooks for MLF.However there is notes but I need few textbooks for much clarification .Where can I find them??",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/textbooks-for-mlf/176834"
  },
  {
    "text": "Unavailibility of Student ID as username on github Hi Team,\nI am unable to set my username as my student Id because I deleted it a month back. As a workaround, I have set my username as 21f1001935-MAD-1 for now.\nShould I go ahead with this username or change it ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/unavailibility-of-student-id-as-username-on-github/176845"
  },
  {
    "text": "Doubt in week 2 image1371×743 116 KB\nIn question, The datatype of ID is int, So, why 4th option is also correct as there is string datatype for ID in 4th option ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-week-2/176607"
  },
  {
    "text": "Doubt regarding determinant expansion and sign convention in question 2 AQ 1.5 Hi everyone,\nI have a doubt about determinant expansion in Q2 of AQ1.5 (please see attached question below \nimage1110×776 63.1 KB\nThe question asks:\nWhich of the following is(are) correct?\nMy confusion:\nI selected the options that match the standard cofactor expansion with alternating signs , but the quiz also accepted an option with all plus signs as correct (see green “Accepted Answers” in the screenshot).\nMy question:\n\nIs it mathematically correct to use all plus signs in the determinant expansion, as in the second accepted answer?\n\n\nUnder what circumstances would an expansion with all plus signs be valid?\n\n\n\nI hope to get clarification and interpretation as soon as possible.\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-determinant-expansion-and-sign-convention-in-question-2-aq-1-5/176859"
  },
  {
    "text": "Project 1 deadline extension No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/project-1-deadline-extension/176644"
  },
  {
    "text": "Subject: Request for Clarification on Assignment Submission Status (GA1, GA2, GA3) I am writing to inform you that I have submitted all the graded assignments—GA1, GA2, and GA3—on time. However, the portal is still showing them as “Not Submitted.” I have worked sincerely and put in a lot of effort into completing these assignments, and I am concerned that the portal might not have registered my submissions correctly. i have saved them before submitting sucessfully.\nI kindly request you to look into this matter at your earliest convenience. More students are facing these issues, please address.\n@Jivraj @Saransh_Saini @HritikRoshan_HRM @21f3002441 @iamprasna @carlton",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/subject-request-for-clarification-on-assignment-submission-status-ga1-ga2-ga3/176851"
  },
  {
    "text": "SWAYAM NPTEL Approved Dep/Free Elective course list not updated Respected Team,\nDoes this SWAYAM NPTEL Approved Dep/Free Elective course list list not updated, as the nptel site is updated on july-dec  semester , please have a look ,till now only one course is showing in the list . “https://docs.google.com/spreadsheets/d/e/2PACX-1vSJXV0JECyoQvgWvBlVxO13G0KRm5a1qNCRBa7rAw8GDY4e0cfm1KiVCwIgs_ed80ObtzQ1rfx_JWIR/pubhtml?gid=399341609&single=true”\nTagging people for quick response @somsubhra , @jkmadathil",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/swayam-nptel-approved-dep-free-elective-course-list-not-updated/176227"
  },
  {
    "text": "Drop course option available? Where is the drop course option available??? The link to it is visible only for a second before it vanishes in course portal. And by the mail, it is said that link is available in calendar app. But I haven’t seen one. Please help.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/drop-course-option-available/176839"
  },
  {
    "text": "About Project 1 Sir deadline for project 1 is 14th June 2025 but it is showing 31st May 2025  when I open the submission link",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/about-project-1/176844"
  },
  {
    "text": "Do you think it’ll be better if we have a centralized calendar instead of separate google cals for each course? I’ve found it pretty frustrating that we have to subscribe to separate calendars for every new course we take. I feel like this might even be contributing to low attendance in live sessions.\nWouldn’t it be more efficient to have a single page on the main website, with dropdown filters for each course? It could sync directly with Google Calendars managed by the course teams.\nAlso—if this is something others are facing too, I’d be happy to collaborate on building a prototype, in case the official team doesn’t take it up.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/do-you-think-itll-be-better-if-we-have-a-centralized-calendar-instead-of-separate-google-cals-for-each-course/176836"
  },
  {
    "text": "Portal issues I am facing the following issues in my portal:\n\n\nWhen I load click on any course in the student dashboard, a new tab opens but the screen is blank. To view the content, I have to reload in order to view the portal.\nimage1920×1080 91.2 KB\nAfter refreshing:\nimage1920×1080 320 KB\n\n\nWhile submitting any assignments, I have to click on the submit button multiple times to submit the assignment.\n\n\nIf anyone knows a workaround for these issues then kindly let me know.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/portal-issues/176691"
  },
  {
    "text": "My course page is not opening in mu pc 20250520_2104471920×2560 159 KB\n20250520_2104351920×2560 124 KB\nplease help.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/my-course-page-is-not-opening-in-mu-pc/175705"
  },
  {
    "text": "How to interact with Discobot and get the ‘Licensed’ badge Hi, I how to get that licensed badge you have any idea regarding it.where is that interactive advanced tutorial is present I searched everywhere in discourse can’t find anylead",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/how-to-interact-with-discobot-and-get-the-licensed-badge/38343"
  },
  {
    "text": "Courses not opening at first instance When I open any course then I am getting this error in console and the page is blank.\nFailed to load module script: Expected a JavaScript-or-Wasm module script but the server responded with a MIME type of \"text/html\". Strict MIME type checking is enforced for module scripts per HTML spec.Understand this error\nruntime.60e78477fe18e74b.js:1 \nFailed to load module script: Expected a JavaScript-or-Wasm module script but the server responded with a MIME type of \"text/html\". Strict MIME type checking is enforced for module scripts per HTML spec.\n\nAfter reloading it two to three times, the error goes and the page starts loading.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/courses-not-opening-at-first-instance/176811"
  },
  {
    "text": "Deadline extension for Mad 2 programming assignment Hi team,\nI was unable to summit the programming assignment for Mad 2 course within the deadline.\nDo I get any date extension for the assignment submission because it’s very important for the marks.\nThanks and regards\nSupravat Bar",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/deadline-extension-for-mad-2-programming-assignment/176828"
  },
  {
    "text": "What are distinct vector? what are distinct vector? and\ncan they be multiple of each other ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/what-are-distinct-vector/176821"
  },
  {
    "text": "Regarding doubts in Python GA Week 2 Answers given on portal after deadline Doubt 1 : Q14\nScreenshot 2025-05-29 0634181987×1480 82.9 KB\n1831×581 56.8 KB\nAnswer should be Raises error because it depends on the content of s. Without knowing the value of s, we cannot guarantee that '3' is present. Also verified by executing the code on google colab as shown in image.\nDoubt 2: Q18\nScreenshot 2025-05-29 0639291810×1483 83.1 KB\nScreenshot 2025-05-29 063953750×306 13.6 KB\n[s[0], s[1], s[3]] creates a list of strings.\n.join() is a string method that concatenates the elements of an iterable (in this case, the list) using the string s as a separator.\nThe result is a new string formed by joining the elements with s in between.\nAlso verified by executing in google colab.\nDoubt 3: Q30\nScreenshot 2025-05-29 0645092229×1569 171 KB\nScreenshot 2025-05-29 064644785×900 24.3 KB\nScreenshot 2025-05-29 0651532094×1678 284 KB\nIt is written in the explanation of the answer below also that all possible combination of the answer will print the same answer but it was a single correct question. It was allowed to mark only one option. So, acc. to me marks should be provided for this question.\nDoubt 4 : Q9\nScreenshot 2025-05-29 0657572107×1552 148 KB\nScreenshot 2025-05-29 0658111565×512 27.3 KB\nScreenshot 2025-05-29 0656101513×377 28.8 KB\nScreenshot 2025-05-29 0657211554×370 28.1 KB\nAs shown , only option E should be the answer to this question. As only in option E output 08.75 will come.  But in accepted answers , both option A and E are showing. So, wanted to confirm that full marks will be provided for marking option E or not.\nRespected concerned authorities, please provide guidance regarding these questions.\n@livin @kubra_7 @Manidipa2001 @PiyushW @umaiyalakshmi\n@23f2004399 @salim0986",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-doubts-in-python-ga-week-2-answers-given-on-portal-after-deadline/176619"
  },
  {
    "text": "Regarding mistake in Week 1 marks showing on dashboard Respected concerned authorities,\nQuery 1 - All my answers are correct in Week 1 GA and GRPA, still it is showing 99 marks on the dashboard.\nIn the grade section also, it is showing more than 100 marks in both week 1 and 2 for many students of this course.\nIf all the answers are correct, it should show 100. I have checked multiple times . In all questions , I have got full marks (No wrong answer or partial marks deducted). Please guide.\nScreenshot 2025-06-01 134953468×284 14.5 KB\nScreenshot 2025-06-01 1350072161×1403 282 KB\nQuery 2 - Approximately until when we can expect GA solutions of week 1 and 2 to show on portal in supplementary contents ?\nPlease guide. @livin @kubra_7 @Manidipa2001 @PiyushW @umaiyalakshmi\n@23f2004399 @salim0986",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-mistake-in-week-1-marks-showing-on-dashboard/176818"
  },
  {
    "text": "Project MAD 1 I got an “I” grade in MAD 1 (Jan 2025 term) due to an incomplete project. I’m now registered in the May 2025 term—should I follow the Jan project statement or the current one?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/project-mad-1/176813"
  },
  {
    "text": "What is non-zero vector space? image664×301 18 KB\nis it something related to zero vector?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/what-is-non-zero-vector-space/176815"
  },
  {
    "text": "Extension for week2 python I had my college exams and missed the week 2 python assignment…now due to this i wont be able to give the oppe1. Also in maths and other courses the week 2 submissions were much later. Can there be any kind of extension in the ga date",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/extension-for-week2-python/176806"
  },
  {
    "text": "Graded Assignment 2 Question 12 s[:3].upper().split() @kubra_7 @livin\nMy specific doubt is on the topic: the below question is wrongly evaluated. The type of the expression is List but its given as raise error which is not the case.\nMy doubt is: \n\nRecommended:\nMention what you have done till now to find clarification on the doubt: ran the code in the editor and it gives proper output and not raises the error.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-2-question-12-s-3-upper-split/176650"
  },
  {
    "text": "Practice Assignment Doubt image938×843 43.1 KB\nMay I know why isn’t Option 5 correct?\nIf that isn’t Then all others i selected will not be correct.\nSo why are Option 3 and 5 not correct?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/practice-assignment-doubt/176756"
  },
  {
    "text": "Ga2, q29 In this question, all the options are correct. Whether the user input c=26 or 25, and d=0 or 26, it provides the same output.\n@livin\n@kubra_7\nPlease look into it.\nimage1046×600 42.6 KB\nimage1046×600 41.8 KB\nimage1046×600 65.7 KB\nimage943×573 37.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-q29/176700"
  },
  {
    "text": "Week 2 Python Graded Assignment Question 13 and 32 I suspect that Python Week 2 Graded Assignment Question 13 and 32 has issues.\nFor Question 13, i don’t think the expression s.lower().isapha() should make any sense. It could be a typing error of .isalpha() with ‘l’ missing\nFor Question 32, all the 4 options gave the desired output which also matches the feedback provided. But the question was single choice and the correct answer has been marked as option 2. When it should have been multi choice and all 4 options should have been correct answer.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-python-graded-assignment-question-13-and-32/176615"
  },
  {
    "text": "Anyone Received Conformation Mail Regarding Paradox’25 Hello everyone only few days remaining for Paradox’25 but I have not received any mail regarding this",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/anyone-received-conformation-mail-regarding-paradox25/176716"
  },
  {
    "text": "AQW02.16: Activity Question 16 - Not Graded image1155×754 63.3 KB\ncan someone help me in question 3 i dont know how to solve it",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/aqw02-16-activity-question-16-not-graded/141980"
  },
  {
    "text": "GA1 - Development Tools - Discussion Thread [TDS May 2025] Hello there,\nThe course content was released today, and I saw the first GA1 that asks us to solve a quiz so that we can know where we stand and make a decision on whether we should take the course now or later. I saw the GA1 quiz content and there are many topics that I don’t know, there are videos pertaining to every question that we can watch and then solve the problems. So, my question is if we had to watch a video to solve the problem for most of them and were able to solve most of the problems should I consider taking the course or if I had to see the videos for most of the questions I should drop the course. I’d like to ask the same question for GA2\n@s.anand\n@carlton\n@iamprasna\n@Jivraj",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga1-development-tools-discussion-thread-tds-may-2025/173524/9"
  },
  {
    "text": "Not added to Gspace @AdarshMadre @\nRespected Sir/Ma’am,\nI have not been added to MAD 1 and MAD 2 Google space yet.\nPlease add me in both the groups as I’ve opted for both the projects this term.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/not-added-to-gspace/176706"
  },
  {
    "text": "General Instructions MAD I May 2025 Welcome Learners \nLead Instructors\n\nShivani Varma @shivani28\nAdarsh Madre @AdarshMadre\nS SATYANARAYANA @satyanarayana\nShri Krishna Pandey @shri_krishna_pandey\n\nTag these instructors if there is no response to your post within the first 12 hours\nTA\nUrjaswi Banerjee @22f3000877\nTag TA if there is no response to your post within the first 6 hours\nTags Usage\n\nPractice Question - week-num-May25-term1practice\nGraded Question - week-num-May25-term1graded\nOperational - operational-May25-term1\nExam - quiz-May25-term1\n\nCalendar\n\nCourse Calendar\n\nImportant Links\n\nYoutube playlist (instructors)\nYoutube playlist (TA)\nCourse portal",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/general-instructions-mad-i-may-2025/161303"
  },
  {
    "text": "MAD 1 Wk4 contents Can anyone please confirm whether MAD wk 4 content has been released? In my student’s portal it is not yet showing.  Regards. Jayanti Thakker",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mad-1-wk4-contents/176795"
  },
  {
    "text": "Deepseek R1 How many of you have seen the DeepSeek R1 model, a state-of-the-art (SOTA) model trained for just $6 million? What do you think is preventing us from developing similar models?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/deepseek-r1/165808"
  },
  {
    "text": "How to manage tds? How should I manage TDS? Can anyone guide me?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/how-to-manage-tds/176754"
  },
  {
    "text": "Doubt/Clarification in W2 GA No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-clarification-in-w2-ga/176317"
  },
  {
    "text": "Python Week1 GRPA 2 doubt Good evening\nI have a doubt in week 1 GRPA 2, output4 is True if a is an odd number within the range -10 and 10 or ```\noutput4 = … # bool: True if a is an odd number within the range -10 and 10\n\nMy answer to it is: output4 = a >= -10 and a <= 10 and a%2 == 1 # bool: True if a is an odd number within the range -10 and 10 \n\nThe test cases are a=7, a=-9, a=15 and expected outputs are True, True, False respectively. \nIn my actual output tab, nothing is being shown in it, it is absolutely empty,\n![Screenshot 2025-05-30 164859|690x388](upload://6O18M8KO1wJf7adCmGKdXnUuwK3.png)\n (print () level empty), please tell me what is wrong with my code. \n\nRegards\nDhruv Dandowtiya",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-week1-grpa-2-doubt/176730"
  },
  {
    "text": "Vercel deployement error While deploying my Virtual TA project, I am getting this error “data is too long”. How can I deal with this error? @s.anand @Jivraj @carlton",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/vercel-deployement-error/176789"
  },
  {
    "text": "Regarding OPPE-SCT doubt I am in diploma level currently, for SCT, is it enough only to join through the meeting link or is there any exam link also?\nAnd i don’t have a mobile stand, can i lean my mobile phone on the shelf so that I and my laptop are properly visible? Can I do like this?\nIn the google form they have mentioned “Please upload your position\nPin your position in laptop & take a screenshot” which screenshot should I attach?\nCan anyone clear my doubts?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-oppe-sct-doubt/176760"
  },
  {
    "text": "WSL installation Do we really need to install WSL and use git? Can we not do it using Github desktop?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/wsl-installation/176786"
  },
  {
    "text": "Project git collabration invite not accepted yet image1499×823 48.2 KB\nI have one concern about that i send an invite for collabarators to mad team as instructed in milestone doc . Since 3 to 4 days its not accepting a request and now it notifies that invite expired .\nWhy this is happening , can anyone know ? or am i doing wrong something ,i commited  gitignore and readme file today itself . So may be i assumed that can be a problem . so i want to ask if i request once more it will accept ?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/project-git-collabration-invite-not-accepted-yet/176577"
  },
  {
    "text": "IIT-M is your institute, isn’t it? In quite a few posts that I have come across in this forum, I have seen phrases such as the following:\n\n“IIT-M should realise that…”\n“IIT-M has not …”\n“Does IIT-M know that…”\n\nTo me, this sounds very similar to:\n\n“Airtel should realise that…”\n“Airtel has not…”\n“Does Airtel know that…”\n\nAirtel is a service provider. You are availing a service. The company, Airtel in this case, and you, the user, are separate entities. There is no connection beyond that.\nIs IIT-M also a service provider or is it larger than that? Is it a B2C organisation that is serving you “education”, or more practically, a degree? Is that all? For example, if you are studying in some offline college doing another degree, call it ABC institute, would you say “ABC should realise that…” or would you rather say, “My institute should realise that…”\nWhat is missing is a sense of belonging. I may be wrong, so please don’t take it in the wrong sense. I am not judging you. In fact, I was guilty of this when I was working at a startup (call it XYZ). I always used to say “Should XYZ implement this policy”. On hearing this, the company’s CTO and my friend used to correct me. “Should we implement this policy”. He did this multiple times while I was there.\n\nI would request those of you who frequent the “IIT-M” word in this capacity, referring to it as something disconnected from you, to ask yourself these questions. I am not suggesting that there is only one answer to this:\n\nWhy am I calling it “IIT-M” as though I am outside the institute?\nAm I not a part of the institute?\nWhat is an institute? In our case, is it just the portal and the TCS exam centers or is there more to it?\n\nYou can use the pronoun, we, in whichever context you want, not just in a positive context. For example, instead of saying “IIT-M’s lectures are bad”, does it make a difference when you say “Our lectures are bad”? Instead of saying, “IIT-M is not listening to our suggestions”, does it make a difference when you say, “Our institute is not listening to our suggestions”.\nIsn’t it a reasonable idea to become a part of the institute and then start thinking about fixing “your” institute’s problem? All institutes have problems. Our institute also has problems. Let us fix them.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/iit-m-is-your-institute-isnt-it/172785"
  },
  {
    "text": "Attending SCT My SCT for foundation level programming in python has been scheduled for jun 1st as deadline.\nIf i am unable to attend it by then will I be given another chance to do my SCT to be eligible for OPPE 1 or 2.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/attending-sct/176779"
  },
  {
    "text": "Tds: assignment is not submitting @carlton @s.anand\ndear sir\ni have taken tds in this term. after the first assignment there was no checkbox provided to any graded assignment .for this reason i just saved the assignment at the portal link .and now after the deadline its showing my assignment had not been submitted. pls do something please do it fast.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-assignment-is-not-submitting/166189"
  },
  {
    "text": "Wrong cgpa please reply please @Bharathi\nIn my dashboard my cgpa was 8.13 till previous term(Jan 2025 term)\nIn my 2025 January progress card my cgpa is 8.13\nIn my 2024 September grade card my cgpa is 8.12\nIn my 2024 September progress card my cgpa is 8.12\nI have mailed about it earlier also.\nPlease resolve this issue as soon as possible.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/wrong-cgpa-please-reply-please/176775"
  },
  {
    "text": "Should We Rethink the Timing of Paradox Fest Given the Current COVID-19 Situation? @POD_TEAM @Karthik_POD @Narayanan.POD @Anand @pod-admins @admins @andrew @Baskaran_Nadar @s.anand @Bharti\nHi everyone,\nAs we all look forward to Paradox Fest, I wanted to open a discussion regarding the recent rise in COVID-19 cases, especially in the northern parts of India. With Paradox attracting nearly 5,000 participants from all over the country, I think it’s important for us as a community to reflect on the potential risks involved.\nGiven that Paradox typically hosts around 5,000 participants from across the country, there is a significant risk that the event could inadvertently contribute to the spread of the virus and potentially turn the campus into an epicenter for the disease. The health and safety of all participants, students, faculty, and staff should remain our top priority.\nI hope the administration will thoroughly analyze the current situation and take a well-informed decision, considering that IIT Madras is a premier institution and its actions set an example for others. The safety and well-being of the community should always come first.\nThank You",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/should-we-rethink-the-timing-of-paradox-fest-given-the-current-covid-19-situation/176543"
  },
  {
    "text": "Passing SCT My specific doubt is on the topic: SCT\nMy doubt is: <I appeared for the SCT. How do I know that I have passed the SCT successfully and eligible for OPPE . Can I attempt the SCT twice in different time slots?>",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/passing-sct/108876"
  },
  {
    "text": "Sct approval What does it means I am eligible or not\n![1000072785|690x482](upload://35jHr1FWeCvEZ0IOkU8Vjt19urY.png",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-approval/176573"
  },
  {
    "text": "Repeat oppe and end term alone in may 2025 term My specific doubt is on the topic: repeat oppe and end term alone may 2025 term.\nMy doubt is: I got an email asking me to fill a form for not submitting week 1 and 2 assignment. But i have applied for oppe and end term alone repeat for may 2025 and its also explicitly mentioned on my course page. So do i need to submit my assignments again? What is happening? Again my course page is displaying 0 for 5 weeks. My sct is 1 and i was asked to fill a form asking me if i need to do the sct again? I was not checking my python due to health issues in my family have been busy with hospitals etc. This is stressful already. Someone please help.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/repeat-oppe-and-end-term-alone-in-may-2025-term/176752"
  },
  {
    "text": "Will missing Week 2 GrPA assignment disqualify me from OPPE? Hi, I’m re-attending this course because I missed the OPPE last time. According to the eligibility criteria that i just saw, to write the OPPE, I need to score an average of ≥40/100 in all weekly GrPA assignments from Week 2 to Week 8. If I miss the Week 2 GrPA assignment, does that mean I cannot attend the OPPE? If so, I might have to drop the course, as my main goal is to attend the OPPE this time. Can someone please confirm? Thank you.\nimage1614×508 69.5 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/will-missing-week-2-grpa-assignment-disqualify-me-from-oppe/176736"
  },
  {
    "text": "Clarification Regarding Submission of Week 1 & 2 Graded Assignments I have received an email stating that I have not submitted the Week 1 and Week 2 graded assignments. However, I would like to clarify that I have already submitted both assignments, and my dashboard also shows them as submitted.\nI am attaching a screenshot of my dashboard for your reference. Kindly verify my submission records and let me know if any further action is required from my side.\n10000789551080×2460 244 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/clarification-regarding-submission-of-week-1-2-graded-assignments/176755"
  },
  {
    "text": "Requesting help/info on Tirupati darshan after convocation I will be coming for convocation ceremony with my father from Jaipur and we want to visit Tirupati temple after that. Our return flight is at 8pm on 9th June from Chennai.\nAssuming we will be free from convocation till 3pm on 8th June, how can we proceed for darshan. Can somebody please help regarding that? I was looking for tickets online but they are all filled up. What is the procedure in this situation?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/requesting-help-info-on-tirupati-darshan-after-convocation/176757"
  },
  {
    "text": "Persistent glitch No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/persistent-glitch/164772"
  },
  {
    "text": "Can’t touch type lol Yup, a bit embarrassed when i say this but still can’t touch type. I have been writing code for the past few years, but i have realized I often need to look at the keyboard to type. My typing style is… let’s just say unconventional (I don’t use all my fingers ). I am starting my internship in a few days and so would love to have some resources or any piece of advice on how to get better at typing. I am pretty slow.\nP.S. I know programming is more about problem solving than raw typing speed, but I just want to get more comfortable and efficient.\nThank you.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/cant-touch-type-lol/173515"
  },
  {
    "text": "Income Verification link Not showing fields Dear sir\nI accessed the submission link and after entering roll no and otp, it takes me to Home where I clicked INCOME VERIFICATION link which was only available option there which took me to dashboard whose screenshots are in the attachment. The fields for entering the income details and uploading Form 26AS and fields for uploading Family Income Certificates etc are not there.\nScreenshot 2025-05-29 2102011920×1140 77.4 KB\nScreenshot 2025-05-29 2111031920×1140 81.2 KB\nkindly find the attachment.\n@Karthik_POD @Baskaran_Nadar @iitmanupam @carlton @H.BHASKAR_934",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/income-verification-link-not-showing-fields/176674"
  },
  {
    "text": "No updation of week 1 and 3 GrPA @23f2004399 @salim0986\nMy specific doubt is on the topic: No updation of week 1 and 3 GrPA\nMy doubt is:\nScreenshot_20250523_1853531080×2340 186 KB\nWhen I was doing the week 1 assignments no GrPa’s were shown in my Modules section - except for the Graded assignment. So when I completed and submitted it and checked my assignment after the due date I saw that suddenly all the GrPAs are present showing that it was not attempted this giving me no grades. In the week 2 I was able to do all the GrPAs but again in the week 3 only the Graded assignment is shown(I’ve uploaded the screenshot of week 3). The grades have been uploaded in week 1 without me being able to do anything as there was no GrPAs present in the week 1 and the same is happening in week 3. Please do something about the week 1 GrPA and also the issue in the week 3 GrPA\nPlease do look into the matter and do the needful.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/no-updation-of-week-1-and-3-grpa/176484"
  },
  {
    "text": "Python oppe repeat alone in May 2025 term @livin\nMy doubt is I have opted for python oppe alone in this may term\nSo that means I should attempt only oppe right?\nWhy grpa assignment new scores are displaying in my python course dashboard as absent which I don’t need to attend right as old grpa will be carried over right?\nFor me which grading policy will be considered\nAs new oppe grading policy was to obtain 40/100 in each grpa alone\nBut in my case the grpa which I attempted in previous term one week grpa I have absent\nDoes it mean it creates any problem\nBecause In previous term there is no such thing\nPlease reply sir\nIt would be very helpful",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-oppe-repeat-alone-in-may-2025-term/176701"
  },
  {
    "text": "Python sct exam I need to repeat sct exam for phyton?? I Cleared SCT exam in previous term .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/python-sct-exam/176723"
  },
  {
    "text": "Query Regarding Missed SCT for SC and Java I am currently out of station and will not be able to appear for the SCTs of SC and Java Programming\n. I wanted to ask:\n\nIs it mandatory to give the SCT in the current window?\nWill there be a second SCT window for these courses?\nIf yes, can I appear in the second window instead?\n\nKindly let me know what options are available in this situation.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-missed-sct-for-sc-and-java/176733"
  },
  {
    "text": "Week 2 Graded Assignment showing “Absent” No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-graded-assignment-showing-absent/176698"
  },
  {
    "text": "Doubt in week 2 grpa5 Good evening all\nIn week 2 grpa 5 only 2 test cases executed successfully out of 5. 1 and 5 ran successfully whereas 2,3,4 did not. Please tell me what is wrong with my code.\nmy code:\nmain_dish = str(input())\ntime_of_day = int(input())\nhas_voucher =   bool ( input ())\nis_card_payment = bool(input())\n\nif main_dish == \"paneer tikka\":\n    cost = 250\nelif main_dish == \"butter chicken\":\n    cost = 240\nelif main_dish == \"masala dosa\":\n    cost = 200\nelse: # if main dish is invalid print invalid dish and exit the code.\n    print(\"Invalid main dish\")\n    exit() \n\nif time_of_day >= 12 and time_of_day <= 15:\n    total_cost = (1 - 0.15) * cost\n\nelse: \n    total_cost = cost\n    \nif has_voucher:\n    total_cost *= 0.9  # Apply voucher discount\n\nif is_card_payment:  # service charge for card payments\n    service_charge = 0.05 * total_cost\n    total_cost += service_charge \n\nprint(f\"{total_cost:.02f}\")\n\n\nI am getting output 226.80 in case 2, 160.65 in case 3 and 236.25 in case 4. Please check what is incorrect in my code.\nReg\nDhruv",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-week-2-grpa5/176734"
  },
  {
    "text": "Week 3 summary in python sir, on portal in live sessions recodings section when will week 3 summary video be available???",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-summary-in-python/176667"
  },
  {
    "text": "Week 3 summary in python sir, on portal in live sessions recodings section when will week 3 summary video be available???",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-3-summary-in-python/176667/1"
  },
  {
    "text": "Sct laptop compatibility Respected Sir/Madam,\nI am writing to formally inquire about the feasibility of taking my upcoming SCT examination on a laptop belonging to another individual. My personal laptop has unfortunately become inoperable due to motherboad malfunction. The last date to take sct is June 1 2025\nAs the OPPE examinations are scheduled for August, I anticipate that my own laptop will be repaired and fully functional by then, allowing me to continue my subsequent exams without further disruption. However, for the immediate SCT, I am facing this unforeseen technical challenge.\nI understand the importance of maintaining exam integrity and adhering to all stipulated guidelines. I am concerned about any potential implications of using a different device, particularly regarding:\n\n\nSystem Compatibility: Ensuring the alternative laptop meets all technical specifications and has the necessary software/browser configurations for the SCT platform.\n\n\nProctoring Requirements: Whether using an unfamiliar device could trigger flags with any online proctoring software, or if specific procedures need to be followed.\n\n\nSecurity Protocols: The security implications of using a different device for a high-stakes examination.\n\n\nCould you please advise on the institution’s policy regarding such situations? Specifically, I would be grateful if you could clarify:\n\n\nWhether it is permissible to take the SCT on a different laptop, given my circumstances.\n\n\nAny particular steps or permissions I need to obtain from the institution before the exam.\n\n\nIf there are any alternative arrangements the institution can provide, such as access to a supervised computer lab or a designated testing facility.\n\n\nI am committed to ensuring a smooth and compliant examination process. Your guidance on this matter would be highly appreciated.\nThank you for your time and consideration.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/sct-laptop-compatibility/176735"
  },
  {
    "text": "Requesting Instructors to Give Us Another Chance for the GA 2 Assignment Programming Assignments Dear  @AtulPS @Bharathi @satyanarayana @Manidipa2001\nI am Aayush , just gone through the grading doc , and seen this grading policy\nEligible to write OPPE:\nStudent has to complete the OPPE System Compatibility Test (SCT) mandatorily\nSoP for the SCT Exam is as follows: Click Here for OPPE SCT SoP Document\nAND\nA2>=40/100 AND A3>=40/100 AND A4>=40/100 AND A5>=40/100 A6>=40/100 AND A7>=40/100 AND A8>=40/100 ,\nI am not against this , but sir many students like me missed Week 2 Grpa , for whatever reasons .\nCan you provide us the 1st and the last chance to submit the assignment , as it will highly impact our grades .\nHere it is like 1 Week is costing us around 20 percent .\nI hope you will consider this request and update us .\nThank You .",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/requesting-instructors-to-give-us-another-chance-for-the-ga-2-assignment-programming-assignments/176499"
  },
  {
    "text": "Query Regarding Missed SCT for Sc No content available",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/query-regarding-missed-sct-for-sc/176729"
  },
  {
    "text": "Ga2, q15 The strip() function removes the trailing and leading whitespace and returns the modified string. So the type of the expression should be string.\n@livin\n@kubra_7\nimage1046×600 23.4 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-q15/176699"
  },
  {
    "text": "About not mail received for registering offline bootcamp Dear IITM MAD1 project team!\nI am Amit Kumar Verma, student of BS program 2024 batch my problem is that I have not received offline bootcamp registration from of (24june - 30 june) slot. My roll number is 24F1000489. I have already done my tickets.\nIt is heartily request is that please give a last chance for registering to offline bootcamp for those students who have not received mail or any kind message yet.\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/about-not-mail-received-for-registering-offline-bootcamp/175336"
  },
  {
    "text": "Stats2 Week2 GA updated as absent Hi,\nHaving submitted week2 GA assignment on time, on the dashboard it shows absent. attached image for reference. I am not clear what went wrong.\n@Prashant2\nimage1891×952 129 KB\nimage1494×717 112 KB\nThanks\nVijay",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/stats2-week2-ga-updated-as-absent/176696"
  },
  {
    "text": "Mathematics for Data Science II Mathematics for Data Science II\nI am writing to inquire about the Previous Year Question (PYQ) Paper Code for the upcoming Quiz I for the Mathematics for Data Science course, scheduled on 13th July 2025. For reference, the question paper code for Quiz I, which I attended on 23rd February 2025, was:\n“IIT M FOUNDATION AN EXAM QDF2 23 Feb 2025”.\nI would be grateful if you could kindly share the corresponding question paper code for Quiz I, as well as the Google Drive link or any official repository, where PYQs for Quiz I are available. This would greatly assist me in preparing more effectively for the upcoming assessment.\nThank you for your support and guidance.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/mathematics-for-data-science-ii/176715"
  },
  {
    "text": "Week 2 Graded assignment is reflecting absent Dear team\nI have submitted my week 2 graded assignment before the deadline but it is reflecting absent on the dashboard. Kindly clarify.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-graded-assignment-is-reflecting-absent/176711"
  },
  {
    "text": "Dashboard shows absent in week 2 assignment My specific doubt is on the topic: <dashboard shows absent in week 2 assignments however it was already submitted in english 2 and stat 2>",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/dashboard-shows-absent-in-week-2-assignment/176695"
  },
  {
    "text": "Week 2 Assignment result error370×394 26.1 KB\nI have submitted my week 2 - stats2 assignment before the deadline. But my dashboard has absent marked against it where as in the grades section I am able to see the marks for the submitted week 2 assignment",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-assignment-result/176719"
  },
  {
    "text": "Regarding payment issue Sir I have done  payment for accommodation but there is no confirmation mail arrived from  paradox team\nAnd the registration form open again that showing payment again\n10000448531080×2400 163 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-payment-issue/172651"
  },
  {
    "text": "Doubt Regarding MAD 1Project Can anyone please tell what should be done for this? where to refer the guidelines for this ?what to do ? any submissions?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-mad-1project/176605"
  },
  {
    "text": "Clarification Regarding SCT Approval and Willingness to Re-Attend SCT I had completed the SCT in the Jan 2025 term, and as informed, the SCT is valid for three terms. But my dashboard has not been updated yet. While most of the students whose SCT was approved from previous terms have their dashboard showing ‘OPPE AND SCT APPROVAL - 1.00’, but mine still does not reflect this status.\nFor this term I have DBMS for OPPE.\nI have received an email regarding ‘Willingness to Re-Attend SCT’. I am unsure whether I should select ‘Yes’ or ‘No’ in that form. I would appreciate it if anyone could guide me on what to choose based on my current status.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/clarification-regarding-sct-approval-and-willingness-to-re-attend-sct/176693"
  },
  {
    "text": "Missed Deadline for week 2 Respected Sir/Ma’am,\nDue to heavy rainfall in the area there was a power surge and no electricity in my area. I have Missed the week 2 deadline by minutes due to this issue. The PDSA course has a clause for OPPE eligibility to have week 2 avg >40. It is my sincere request to push the deadline by one day since it might cost me heavily,\nI Had already submitted a ticket last night at 1240. They replied today saying that I should upload the same on the discourse forum. Please Consider,\nThank you",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/missed-deadline-for-week-2/176444"
  },
  {
    "text": "Request for Clarification Regarding Week 2 GRPA Submission in PDSA Course @AtulPS @satyanarayana @Manidipa2001\nI hope this message finds you well.\nI am writing to inform you about an issue I encountered with the Week 2 GRPA in the PDSA course. Unfortunately, I forgot to click the “Submit” button after completing my responses. This was an unintentional mistake, and I realized it only after the deadline had passed.\nI am concerned about how this might affect my eligibility for the OPPE in the PDSA course. Could you please clarify if missing this submission will make me ineligible for the OPPE, even though my assignment marks are otherwise satisfactory? If so, I kindly request if there is any possibility of reconsideration due to my overall performance in the assignments.\nThank you for your understanding and support. I look forward to your guidance on how to proceed.\nBest regards,\nArman",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/request-for-clarification-regarding-week-2-grpa-submission-in-pdsa-course/176520"
  },
  {
    "text": "Week 2 Graded Assignment-Marked Absent - For Statistics and Mathematics On my course page I am seeing that for Week 2 Mathematics and English is marked as Absent I have submitted the assignments prior in time. Is this a technical glitch.\nimage816×352 58.6 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/week-2-graded-assignment-marked-absent-for-statistics-and-mathematics/176702"
  },
  {
    "text": "DBMS Week 2 Graded Assignment - Doubts My specific doubt is on the answer key provided for Week 2 Graded Assignment of DBMS.\nAs per my conceptual understanding,\nimage1242×990 93.6 KB\nthe highlighted option is also not valid as Stock is mentioned to be >= 0, which means NULL should not be allowed as a valid value for Stock.\nWhy then is it marked as a valid option?\nAlso the provided answer for the 5th question (same assignment) appears incorrect to me.\nAnd here\nimage518×772 45.5 KB\nI agree that the provided answer is correct, but my answer (highlighted) also seems correct. Why is using the ‘min’ aggregate function incorrect here?\nWould appreciate some clarification.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/dbms-week-2-graded-assignment-doubts/176709"
  },
  {
    "text": "PDSA - OPPE eligibility conditions are very harsh and unreasonable Dear Course Support,\n@AtulPS @Manidipa2001 @satyanarayana @T.Naveen\nAfter the start of the course the grading policy for PDSA has been changed to score >=40 marks in A2, A3 …till A8 in GrPA assignments. This was not there at the time of start of the term. Announcement came on 20 May just 5 days before deadline of the week. This is the online programme and with expectation of some flexibility people enroll so that they can still  work full time or travel for work etc.\nIn the week of 20th May, I was travelling could attempt only 1 out of 3 GrPA questions.\nSubmission and score >=40 for every assignment till A2 to A8 is a very strict condition for working professionals. With full time jobs, it is possible to miss 1 or 2 assignments.\nAlso there is no OPPE that can be scheduled next term if we pass the PDSA course.\nHence we have no chance to improve the OPPE marks alone which is 20% of the total. I am currently at CGPA of >9 and it would be unfair to lose 20% in OPPE just because of missing one assignment. You have got to give chance to students to appear OPPEs in a little reasonable manner. If the student is really doing well overall he/she will do well in the OPPE as well, why snatch a chance of student from even appearing for OPPE just for one or two assignments.\n Therefore, it is kindly requested that the method of average of “XX” best Assignments out of 8 assignments be please considered for eligibility for OPPE as was the case earlier. This way we have a chance to prove ourselves in OPPE and not lose 20 % marks in the total grading for missing a single assignment in A2 to A8. This is severe penalty for a small lapse in weekly assignment. \nNote:- In the discourse forum in relevant post, the course instructor has told us to write to support.\n\n Please consider this, it is a sincere request from students community.\n\nRegards,\nsandeepkumar",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/pdsa-oppe-eligibility-conditions-are-very-harsh-and-unreasonable/176685"
  },
  {
    "text": "Re- week 2 Grpa Submition problem I don’t know how my post is deleted without a proper solution.\nMy problem is I missed Grpa week 2 submition due to some technical issues and now support team is as for proof and the only I have is my login session as I was unaware of these type of problem at due to glitch I will 20 percent of my marks just for 1 assignment and to not because of my mistake – portal mistake\nI know that week 2 answers are released but\nIF I would have valid proofs then in that situation team would have done something that same thing should be done in my case also .\nPlease help!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/re-week-2-grpa-submition-problem/176642"
  },
  {
    "text": "Course Dashboard is not working My course dashboard is not working, it is showing blur screen on my laptop since morning. Everything else is working fine, don’t know what is happening.\nI am attaching the screenshot of my screen\nScreenshot 2024-11-24 2130541917×947 104 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/course-dashboard-is-not-working/157211"
  },
  {
    "text": "Vite/ Vue CLI can we use Vite/ Vue CLI to set up our project for MAD 2? also VueX can be used but not Pinia, right?",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/vite-vue-cli/176584"
  },
  {
    "text": "Doubt in activity questions My specific doubt is on the topic: \nMy doubt is: <in the activity question 3.3 question no 10>\n\nMention what you have done till now to find clarification on the doubt: < I tried to find the value for alpha , beta and gama by the formula of linear combination but cannot come to a correct answer could you please give me the solution how to check linear dependency in these type of matrices>",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-in-activity-questions/176590"
  },
  {
    "text": "Exam duration Hi everyone,\nI had a quick doubt regarding the exam protocols for Quiz 1, Quiz 2, and the End Term exam. If I finish the exam before the allotted duration, am I allowed to leave the exam center early, or do I need to stay until the full time is over?\nJust asking to understand if it’s possible to save time and avoid unnecessary waiting. Would appreciate any clarification.\nThanks!",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/exam-duration/176681"
  },
  {
    "text": "PDSA - OPPE eligibility conditions to be relaxed regarding Dear Support,\nAfter the start of the course the grading policy for PDSA has been changed to score >=40 marks in A2, A3 …till A8 in GrPA assignments. This was not there at the time of start of the term.\nSubmission and score >=40 for every assignment till A2 to A8 is a very strict condition for working professionals. With full time jobs, it is possible to miss 1 or 2 assignments.\nLike in Week 2 , I could attend only one GrPA question in the time available to me as I was travelling in that week.\nAlso there is no OPPE that can be scheduled next term if we pass the PDSA course.\nHence we have no chance to improve the OPPE marks alone which is 20% of the total. I am currently at CGPA of >9 and it would be unfair to lose 20% in OPPE just because of missing one assignment. You have got to give chance to students to appear OPPEs in a little reasonable manner. If the student is really doing well overall he/she will do well in the OPPE as well, why snatch a chance of student from even appearing for OPPE just for one or two assignments.\nTherefore, it is kindly requested that the method of average of  “XX”  best Assignments out of 8 assignments  be please considered for eligibility for OPPE  as was the case earlier. This way we have a chance to prove ourselves in OPPE and not lose 20 % marks in the total grading for missing a single assignment in A2 to A8. This is severe penalty for a small lapse in weekly assignment.\nNote:- In the discourse forum in relevant post, the course instructor has told us to write to support.\nPlease consider this, it is a sincere request from student community.\nRegards,\nsandeepkumar",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/pdsa-oppe-eligibility-conditions-to-be-relaxed-regarding/176683"
  },
  {
    "text": "Student Software Perks: Get Premium Tools for Free (or Almost Free) One of the best-kept secrets of being a student is access to powerful software tools at little to no cost—just by using your student email or ID. Here are some of the most useful ones:\n1. Notion Plus – FREE for Students\n\nWhat you get: The Plus Plan, normally a paid tier, is free for students.\nFeatures: Unlimited blocks, version history, file uploads up to 5MB, advanced collaboration.\nUse it for: Note-taking, planning, managing coursework, building a portfolio, or even personal journaling.\n\n2. Perplexity AI Pro – FREE or Discounted (varies by institution)\n\nWhat you get: Access to Pro features, including faster responses, access to GPT-4, better search results, and file/document upload.\nUse it for: Research, summarizing papers, asking follow-up questions, and staying organized during assignments.\n\n3. Canva Pro – FREE with Canva for Education\n\nWhat you get: Full Canva Pro access for free (especially for verified .edu or .ac.in emails).\nFeatures: Premium templates, design tools, background remover, brand kits, and team collaboration tools.\nUse it for: Making presentations, resumes, portfolios, social media posts, and event posters.\n\n4. GitHub Student Developer Pack\n\nWhat you get: A massive bundle of free tools and credits from top developer services.\nIncludes: Free domains (Namecheap), hosting (Netlify, Heroku), cloud credits, design software, and access to premium coding tools.\nUse it for: Building projects, learning web development, collaborating with open-source communities.\n\n5. Microsoft Office 365 – FREE for Students\n\nWhat you get: Full access to Word, Excel, PowerPoint, OneNote, Teams, and more.\nUse it for: Academic writing, spreadsheets, group work, and cloud syncing via OneDrive.\n\n6. Adobe Creative Cloud – Discounted\n\nWhat you get: Around 60-70% off on Adobe tools like Photoshop, Illustrator, Premiere Pro, etc.\nUse it for: Video editing, graphic design, digital art, and photography.\n\nhttps://www.myunidays.com/IN/en-IN/home?rd=true   also You can use this website to find more benefits.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/student-software-perks-get-premium-tools-for-free-or-almost-free/176363"
  },
  {
    "text": "Not able to find course drop option Unable to find the course drop option in academic calender pls help",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/not-able-to-find-course-drop-option/176672"
  },
  {
    "text": "Regarding answer to python graded assignment week 2 Q 10 My doubt is: Python Week 2 Graded Assignment Q 10\nimage441×155 2.49 KB\nThe output I got on running this code snippet has spaces in between the slashes.However the answer provied shows the output without spaces.Requesting you to clarify regarding the appropriate ans for this question .\nimage975×545 66.8 KB\n@kubra_7 @livin could you clarify regarding the spaces in the answer.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/regarding-answer-to-python-graded-assignment-week-2-q-10/176665"
  },
  {
    "text": "Wrong cgpa please reply In my dashboard my cgpa was 8.13 till previous term(Jan 2025 term)\nIn my 2025 January progress card my cgpa is 8.13\nIn my 2024 September grade card my cgpa is 8.12\nIn my 2024 September progress card my cgpa is 8.12\nI have mailed about it earlier also.\nPlease resolve this issue as soon as possible.",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/wrong-cgpa-please-reply/176664"
  },
  {
    "text": "Doubt regarding adding collaborator @shivani28 , @shri_krishna_pandey , @ym496 , I have the following questions         :      1) I have filled out the form before adding mad2 as collaborator just like it was mentioned in the following instructions. I hope it is correct .\nScreenshot (203)1920×763 83.1 KB\n2) after I have added the collaborator, it is showing ‘pending invite’,  when will it be accepted ? I am very anxious .\nScreenshot (202)1920×898 62 KB",
    "url": "https://discourse.onlinedegree.iitm.ac.in/t/doubt-regarding-adding-collaborator/176556"
  }
]
